TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Thu Dec 01 13:25:52 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/Magnetometer.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram
      15                            .dwattr $C$DW$1, DW_AT_name("vTaskDelay")

    1720                            .dwattr $C$DW$154, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1721                            .dwattr $C$DW$154, DW_AT_decl_line(0x7e)
    1722                            .dwattr $C$DW$154, DW_AT_decl_column(0x02)
    1723                    
    1724                    $C$DW$155       .dwtag  DW_TAG_enumerator
    1725                            .dwattr $C$DW$155, DW_AT_name("eSetValueWithOverwrite")
    1726                            .dwattr $C$DW$155, DW_AT_const_value(0x03)
    1727                            .dwattr $C$DW$155, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1728                            .dwattr $C$DW$155, DW_AT_decl_line(0x7f)
    1729                            .dwattr $C$DW$155, DW_AT_decl_column(0x02)
    1730                    
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   34

    1731                    $C$DW$156       .dwtag  DW_TAG_enumerator
    1732                            .dwattr $C$DW$156, DW_AT_name("eSetValueWithoutOverwrite")
    1733                            .dwattr $C$DW$156, DW_AT_const_value(0x04)
    1734                            .dwattr $C$DW$156, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1735                            .dwattr $C$DW$156, DW_AT_decl_line(0x80)
    1736                            .dwattr $C$DW$156, DW_AT_decl_column(0x02)
    1737                    
    1738                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1739                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x7b)
    1740                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x01)
    1741                            .dwendtag $C$DW$T$87
    1742                    
    1743                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    1744                            .dwattr $C$DW$T$88, DW_AT_name("eNotifyAction")
    1745                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    1746                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1747                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1748                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x81)
    1749                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x03)
    1750                    
    1751                    
    1752                    $C$DW$T$89      .dwtag  DW_TAG_enumeration_type
    1753                            .dwattr $C$DW$T$89, DW_AT_byte_size(0x01)
    1754                    $C$DW$157       .dwtag  DW_TAG_enumerator
    1755                            .dwattr $C$DW$157, DW_AT_name("eAbortSleep")
    1756                            .dwattr $C$DW$157, DW_AT_const_value(0x00)
    1757                            .dwattr $C$DW$157, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1758                            .dwattr $C$DW$157, DW_AT_decl_line(0xb5)
    1759                            .dwattr $C$DW$157, DW_AT_decl_column(0x02)
    1760                    
    1761                    $C$DW$158       .dwtag  DW_TAG_enumerator
    1762                            .dwattr $C$DW$158, DW_AT_name("eStandardSleep")
    1763                            .dwattr $C$DW$158, DW_AT_const_value(0x01)
    1764                            .dwattr $C$DW$158, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1765                            .dwattr $C$DW$158, DW_AT_decl_line(0xb6)
    1766                            .dwattr $C$DW$158, DW_AT_decl_column(0x02)
    1767                    
    1768                    $C$DW$159       .dwtag  DW_TAG_enumerator
    1769                            .dwattr $C$DW$159, DW_AT_name("eNoTasksWaitingTimeout")
    1770                            .dwattr $C$DW$159, DW_AT_const_value(0x02)
    1771                            .dwattr $C$DW$159, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1772                            .dwattr $C$DW$159, DW_AT_decl_line(0xb7)
    1773                            .dwattr $C$DW$159, DW_AT_decl_column(0x02)
    1774                    
    1775                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1776                            .dwattr $C$DW$T$89, DW_AT_decl_line(0xb4)
    1777                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x01)
    1778                            .dwendtag $C$DW$T$89
    1779                    
    1780                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    1781                            .dwattr $C$DW$T$90, DW_AT_name("eSleepModeStatus")
    1782                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    1783                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    1784                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1785                            .dwattr $C$DW$T$90, DW_AT_decl_line(0xb8)
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   35

    1786                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    1787                    
    1788                    
    1789                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1790                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1791                    $C$DW$160       .dwtag  DW_TAG_member
    1792                            .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1793                            .dwattr $C$DW$160, DW_AT_name("ui8Addr")
    1794                            .dwattr $C$DW$160, DW_AT_TI_symbol_name("ui8Addr")
    1795                            .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796                            .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1797                            .dwattr $C$DW$160, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1798                            .dwattr $C$DW$160, DW_AT_decl_line(0x4c)
    1799                            .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    1800                    
    1801                    $C$DW$161       .dwtag  DW_TAG_member
    1802                            .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    1803                            .dwattr $C$DW$161, DW_AT_name("pui8WriteData")
    1804                            .dwattr $C$DW$161, DW_AT_TI_symbol_name("pui8WriteData")
    1805                            .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1806                            .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1807                            .dwattr $C$DW$161, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1808                            .dwattr $C$DW$161, DW_AT_decl_line(0x51)
    1809                            .dwattr $C$DW$161, DW_AT_decl_column(0x14)
    1810                    
    1811                    $C$DW$162       .dwtag  DW_TAG_member
    1812                            .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$22)
    1813                            .dwattr $C$DW$162, DW_AT_name("ui16WriteCount")
    1814                            .dwattr $C$DW$162, DW_AT_TI_symbol_name("ui16WriteCount")
    1815                            .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1816                            .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1817                            .dwattr $C$DW$162, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1818                            .dwattr $C$DW$162, DW_AT_decl_line(0x56)
    1819                            .dwattr $C$DW$162, DW_AT_decl_column(0x0e)
    1820                    
    1821                    $C$DW$163       .dwtag  DW_TAG_member
    1822                            .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$22)
    1823                            .dwattr $C$DW$163, DW_AT_name("ui16WriteBatchSize")
    1824                            .dwattr $C$DW$163, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1825                            .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1826                            .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1827                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1828                            .dwattr $C$DW$163, DW_AT_decl_line(0x5b)
    1829                            .dwattr $C$DW$163, DW_AT_decl_column(0x0e)
    1830                    
    1831                    $C$DW$164       .dwtag  DW_TAG_member
    1832                            .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$23)
    1833                            .dwattr $C$DW$164, DW_AT_name("pui8ReadData")
    1834                            .dwattr $C$DW$164, DW_AT_TI_symbol_name("pui8ReadData")
    1835                            .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1836                            .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1837                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1838                            .dwattr $C$DW$164, DW_AT_decl_line(0x60)
    1839                            .dwattr $C$DW$164, DW_AT_decl_column(0x0e)
    1840                    
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   36

    1841                    $C$DW$165       .dwtag  DW_TAG_member
    1842                            .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$22)
    1843                            .dwattr $C$DW$165, DW_AT_name("ui16ReadCount")
    1844                            .dwattr $C$DW$165, DW_AT_TI_symbol_name("ui16ReadCount")
    1845                            .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1846                            .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1847                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1848                            .dwattr $C$DW$165, DW_AT_decl_line(0x65)
    1849                            .dwattr $C$DW$165, DW_AT_decl_column(0x0e)
    1850                    
    1851                    $C$DW$166       .dwtag  DW_TAG_member
    1852                            .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$22)
    1853                            .dwattr $C$DW$166, DW_AT_name("ui16ReadBatchSize")
    1854                            .dwattr $C$DW$166, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1855                            .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1856                            .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1857                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1858                            .dwattr $C$DW$166, DW_AT_decl_line(0x6a)
    1859                            .dwattr $C$DW$166, DW_AT_decl_column(0x0e)
    1860                    
    1861                    $C$DW$167       .dwtag  DW_TAG_member
    1862                            .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$28)
    1863                            .dwattr $C$DW$167, DW_AT_name("pfnCallback")
    1864                            .dwattr $C$DW$167, DW_AT_TI_symbol_name("pfnCallback")
    1865                            .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1866                            .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1867                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1868                            .dwattr $C$DW$167, DW_AT_decl_line(0x6f)
    1869                            .dwattr $C$DW$167, DW_AT_decl_column(0x16)
    1870                    
    1871                    $C$DW$168       .dwtag  DW_TAG_member
    1872                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$3)
    1873                            .dwattr $C$DW$168, DW_AT_name("pvCallbackData")
    1874                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("pvCallbackData")
    1875                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1876                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1877                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1878                            .dwattr $C$DW$168, DW_AT_decl_line(0x74)
    1879                            .dwattr $C$DW$168, DW_AT_decl_column(0x0b)
    1880                    
    1881                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1882                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1883                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1884                            .dwendtag $C$DW$T$29
    1885                    
    1886                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1887                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1888                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1889                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1890                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1891                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1892                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    1893                    
    1894                    
    1895                    $C$DW$T$31      .dwtag  DW_TAG_array_type
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   37

    1896                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    1897                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1898                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    1899                    $C$DW$169       .dwtag  DW_TAG_subrange_type
    1900                            .dwattr $C$DW$169, DW_AT_upper_bound(0x09)
    1901                    
    1902                            .dwendtag $C$DW$T$31
    1903                    
    1904                    
    1905                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1906                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    1907                    $C$DW$170       .dwtag  DW_TAG_member
    1908                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$24)
    1909                            .dwattr $C$DW$170, DW_AT_name("ui32Base")
    1910                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("ui32Base")
    1911                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1913                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1914                            .dwattr $C$DW$170, DW_AT_decl_line(0x82)
    1915                            .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    1916                    
    1917                    $C$DW$171       .dwtag  DW_TAG_member
    1918                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1919                            .dwattr $C$DW$171, DW_AT_name("ui8Int")
    1920                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("ui8Int")
    1921                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1922                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1923                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1924                            .dwattr $C$DW$171, DW_AT_decl_line(0x87)
    1925                            .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    1926                    
    1927                    $C$DW$172       .dwtag  DW_TAG_member
    1928                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1929                            .dwattr $C$DW$172, DW_AT_name("ui8TxDMA")
    1930                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("ui8TxDMA")
    1931                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1932                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1933                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1934                            .dwattr $C$DW$172, DW_AT_decl_line(0x8c)
    1935                            .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    1936                    
    1937                    $C$DW$173       .dwtag  DW_TAG_member
    1938                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1939                            .dwattr $C$DW$173, DW_AT_name("ui8RxDMA")
    1940                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ui8RxDMA")
    1941                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1942                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1943                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1944                            .dwattr $C$DW$173, DW_AT_decl_line(0x91)
    1945                            .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    1946                    
    1947                    $C$DW$174       .dwtag  DW_TAG_member
    1948                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1949                            .dwattr $C$DW$174, DW_AT_name("ui8State")
    1950                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ui8State")
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   38

    1951                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1952                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1953                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1954                            .dwattr $C$DW$174, DW_AT_decl_line(0x96)
    1955                            .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    1956                    
    1957                    $C$DW$175       .dwtag  DW_TAG_member
    1958                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1959                            .dwattr $C$DW$175, DW_AT_name("ui8ReadPtr")
    1960                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("ui8ReadPtr")
    1961                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1962                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1963                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1964                            .dwattr $C$DW$175, DW_AT_decl_line(0x9c)
    1965                            .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    1966                    
    1967                    $C$DW$176       .dwtag  DW_TAG_member
    1968                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1969                            .dwattr $C$DW$176, DW_AT_name("ui8WritePtr")
    1970                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("ui8WritePtr")
    1971                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1972                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1973                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1974                            .dwattr $C$DW$176, DW_AT_decl_line(0xa2)
    1975                            .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    1976                    
    1977                    $C$DW$177       .dwtag  DW_TAG_member
    1978                            .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$22)
    1979                            .dwattr $C$DW$177, DW_AT_name("ui16Index")
    1980                            .dwattr $C$DW$177, DW_AT_TI_symbol_name("ui16Index")
    1981                            .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1982                            .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1983                            .dwattr $C$DW$177, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1984                            .dwattr $C$DW$177, DW_AT_decl_line(0xa7)
    1985                            .dwattr $C$DW$177, DW_AT_decl_column(0x0e)
    1986                    
    1987                    $C$DW$178       .dwtag  DW_TAG_member
    1988                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$31)
    1989                            .dwattr $C$DW$178, DW_AT_name("pCommands")
    1990                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("pCommands")
    1991                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1992                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1993                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1994                            .dwattr $C$DW$178, DW_AT_decl_line(0xac)
    1995                            .dwattr $C$DW$178, DW_AT_decl_column(0x12)
    1996                    
    1997                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1998                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    1999                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    2000                            .dwendtag $C$DW$T$32
    2001                    
    2002                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    2003                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    2004                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2005                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   39

    2006                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2007                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    2008                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    2009                    
    2010                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2011                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2012                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2013                    
    2014                    
    2015                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2016                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    2017                    $C$DW$179       .dwtag  DW_TAG_member
    2018                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$34)
    2019                            .dwattr $C$DW$179, DW_AT_name("psI2CInst")
    2020                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("psI2CInst")
    2021                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2022                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2023                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2024                            .dwattr $C$DW$179, DW_AT_decl_line(0xf0)
    2025                            .dwattr $C$DW$179, DW_AT_decl_column(0x14)
    2026                    
    2027                    $C$DW$180       .dwtag  DW_TAG_member
    2028                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$35)
    2029                            .dwattr $C$DW$180, DW_AT_name("pui8Buffer")
    2030                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("pui8Buffer")
    2031                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2032                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2033                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2034                            .dwattr $C$DW$180, DW_AT_decl_line(0xf5)
    2035                            .dwattr $C$DW$180, DW_AT_decl_column(0x0d)
    2036                    
    2037                    $C$DW$181       .dwtag  DW_TAG_member
    2038                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2039                            .dwattr $C$DW$181, DW_AT_name("ui8State")
    2040                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("ui8State")
    2041                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2042                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2043                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2044                            .dwattr $C$DW$181, DW_AT_decl_line(0xfa)
    2045                            .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    2046                    
    2047                    $C$DW$182       .dwtag  DW_TAG_member
    2048                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2049                            .dwattr $C$DW$182, DW_AT_name("ui8Addr")
    2050                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui8Addr")
    2051                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2052                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2053                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2054                            .dwattr $C$DW$182, DW_AT_decl_line(0xff)
    2055                            .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    2056                    
    2057                    $C$DW$183       .dwtag  DW_TAG_member
    2058                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$22)
    2059                            .dwattr $C$DW$183, DW_AT_name("ui16Mask")
    2060                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui16Mask")
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   40

    2061                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2062                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2063                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2064                            .dwattr $C$DW$183, DW_AT_decl_line(0x104)
    2065                            .dwattr $C$DW$183, DW_AT_decl_column(0x0e)
    2066                    
    2067                    $C$DW$184       .dwtag  DW_TAG_member
    2068                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$22)
    2069                            .dwattr $C$DW$184, DW_AT_name("ui16Value")
    2070                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("ui16Value")
    2071                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2072                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2073                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2074                            .dwattr $C$DW$184, DW_AT_decl_line(0x109)
    2075                            .dwattr $C$DW$184, DW_AT_decl_column(0x0e)
    2076                    
    2077                    $C$DW$185       .dwtag  DW_TAG_member
    2078                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$28)
    2079                            .dwattr $C$DW$185, DW_AT_name("pfnCallback")
    2080                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("pfnCallback")
    2081                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2082                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2083                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2084                            .dwattr $C$DW$185, DW_AT_decl_line(0x10f)
    2085                            .dwattr $C$DW$185, DW_AT_decl_column(0x16)
    2086                    
    2087                    $C$DW$186       .dwtag  DW_TAG_member
    2088                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$3)
    2089                            .dwattr $C$DW$186, DW_AT_name("pvCallbackData")
    2090                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("pvCallbackData")
    2091                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2092                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2093                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2094                            .dwattr $C$DW$186, DW_AT_decl_line(0x114)
    2095                            .dwattr $C$DW$186, DW_AT_decl_column(0x0b)
    2096                    
    2097                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2098                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    2099                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2100                            .dwendtag $C$DW$T$36
    2101                    
    2102                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    2103                            .dwattr $C$DW$T$91, DW_AT_name("tI2CMReadModifyWrite16")
    2104                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$36)
    2105                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2106                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2107                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x116)
    2108                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x01)
    2109                    
    2110                    $C$DW$T$92      .dwtag  DW_TAG_pointer_type
    2111                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    2112                            .dwattr $C$DW$T$92, DW_AT_address_class(0x20)
    2113                    
    2114                    
    2115                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   41

    2116                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    2117                    $C$DW$187       .dwtag  DW_TAG_member
    2118                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$34)
    2119                            .dwattr $C$DW$187, DW_AT_name("psI2CInst")
    2120                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("psI2CInst")
    2121                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2122                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2123                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2124                            .dwattr $C$DW$187, DW_AT_decl_line(0x123)
    2125                            .dwattr $C$DW$187, DW_AT_decl_column(0x14)
    2126                    
    2127                    $C$DW$188       .dwtag  DW_TAG_member
    2128                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$37)
    2129                            .dwattr $C$DW$188, DW_AT_name("pui8Buffer")
    2130                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("pui8Buffer")
    2131                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2132                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2133                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2134                            .dwattr $C$DW$188, DW_AT_decl_line(0x128)
    2135                            .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    2136                    
    2137                    $C$DW$189       .dwtag  DW_TAG_member
    2138                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$22)
    2139                            .dwattr $C$DW$189, DW_AT_name("ui16Count")
    2140                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("ui16Count")
    2141                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2142                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2143                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2144                            .dwattr $C$DW$189, DW_AT_decl_line(0x12d)
    2145                            .dwattr $C$DW$189, DW_AT_decl_column(0x0e)
    2146                    
    2147                    $C$DW$190       .dwtag  DW_TAG_member
    2148                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    2149                            .dwattr $C$DW$190, DW_AT_name("pui8Data")
    2150                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("pui8Data")
    2151                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2152                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2153                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2154                            .dwattr $C$DW$190, DW_AT_decl_line(0x132)
    2155                            .dwattr $C$DW$190, DW_AT_decl_column(0x14)
    2156                    
    2157                    $C$DW$191       .dwtag  DW_TAG_member
    2158                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$28)
    2159                            .dwattr $C$DW$191, DW_AT_name("pfnCallback")
    2160                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("pfnCallback")
    2161                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2162                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2163                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2164                            .dwattr $C$DW$191, DW_AT_decl_line(0x137)
    2165                            .dwattr $C$DW$191, DW_AT_decl_column(0x16)
    2166                    
    2167                    $C$DW$192       .dwtag  DW_TAG_member
    2168                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$3)
    2169                            .dwattr $C$DW$192, DW_AT_name("pvCallbackData")
    2170                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("pvCallbackData")
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   42

    2171                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2172                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2173                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2174                            .dwattr $C$DW$192, DW_AT_decl_line(0x13c)
    2175                            .dwattr $C$DW$192, DW_AT_decl_column(0x0b)
    2176                    
    2177                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2178                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x11e)
    2179                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x01)
    2180                            .dwendtag $C$DW$T$38
    2181                    
    2182                    $C$DW$T$49      .dwtag  DW_TAG_typedef
    2183                            .dwattr $C$DW$T$49, DW_AT_name("tI2CMWrite8")
    2184                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$38)
    2185                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    2186                            .dwattr $C$DW$T$49, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2187                            .dwattr $C$DW$T$49, DW_AT_decl_line(0x13e)
    2188                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    2189                    
    2190                    
    2191                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2192                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    2193                    $C$DW$193       .dwtag  DW_TAG_member
    2194                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$34)
    2195                            .dwattr $C$DW$193, DW_AT_name("psI2CInst")
    2196                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("psI2CInst")
    2197                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2198                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2199                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2200                            .dwattr $C$DW$193, DW_AT_decl_line(0xbc)
    2201                            .dwattr $C$DW$193, DW_AT_decl_column(0x14)
    2202                    
    2203                    $C$DW$194       .dwtag  DW_TAG_member
    2204                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$35)
    2205                            .dwattr $C$DW$194, DW_AT_name("pui8Buffer")
    2206                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("pui8Buffer")
    2207                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2208                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2209                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2210                            .dwattr $C$DW$194, DW_AT_decl_line(0xc1)
    2211                            .dwattr $C$DW$194, DW_AT_decl_column(0x0d)
    2212                    
    2213                    $C$DW$195       .dwtag  DW_TAG_member
    2214                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2215                            .dwattr $C$DW$195, DW_AT_name("ui8State")
    2216                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("ui8State")
    2217                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2218                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2219                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2220                            .dwattr $C$DW$195, DW_AT_decl_line(0xc6)
    2221                            .dwattr $C$DW$195, DW_AT_decl_column(0x0d)
    2222                    
    2223                    $C$DW$196       .dwtag  DW_TAG_member
    2224                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2225                            .dwattr $C$DW$196, DW_AT_name("ui8Addr")
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   43

    2226                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("ui8Addr")
    2227                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2228                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2229                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2230                            .dwattr $C$DW$196, DW_AT_decl_line(0xcb)
    2231                            .dwattr $C$DW$196, DW_AT_decl_column(0x0d)
    2232                    
    2233                    $C$DW$197       .dwtag  DW_TAG_member
    2234                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2235                            .dwattr $C$DW$197, DW_AT_name("ui8Mask")
    2236                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("ui8Mask")
    2237                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2238                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2239                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2240                            .dwattr $C$DW$197, DW_AT_decl_line(0xd0)
    2241                            .dwattr $C$DW$197, DW_AT_decl_column(0x0d)
    2242                    
    2243                    $C$DW$198       .dwtag  DW_TAG_member
    2244                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2245                            .dwattr $C$DW$198, DW_AT_name("ui8Value")
    2246                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("ui8Value")
    2247                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2248                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2249                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2250                            .dwattr $C$DW$198, DW_AT_decl_line(0xd5)
    2251                            .dwattr $C$DW$198, DW_AT_decl_column(0x0d)
    2252                    
    2253                    $C$DW$199       .dwtag  DW_TAG_member
    2254                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$28)
    2255                            .dwattr $C$DW$199, DW_AT_name("pfnCallback")
    2256                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("pfnCallback")
    2257                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2258                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2259                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2260                            .dwattr $C$DW$199, DW_AT_decl_line(0xdb)
    2261                            .dwattr $C$DW$199, DW_AT_decl_column(0x16)
    2262                    
    2263                    $C$DW$200       .dwtag  DW_TAG_member
    2264                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$3)
    2265                            .dwattr $C$DW$200, DW_AT_name("pvCallbackData")
    2266                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("pvCallbackData")
    2267                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2268                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2269                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2270                            .dwattr $C$DW$200, DW_AT_decl_line(0xe0)
    2271                            .dwattr $C$DW$200, DW_AT_decl_column(0x0b)
    2272                    
    2273                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2274                            .dwattr $C$DW$T$39, DW_AT_decl_line(0xb7)
    2275                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2276                            .dwendtag $C$DW$T$39
    2277                    
    2278                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    2279                            .dwattr $C$DW$T$50, DW_AT_name("tI2CMReadModifyWrite8")
    2280                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   44

    2281                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    2282                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2283                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xe2)
    2284                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x01)
    2285                    
    2286                    
    2287                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2288                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x2c)
    2289                    $C$DW$201       .dwtag  DW_TAG_member
    2290                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$34)
    2291                            .dwattr $C$DW$201, DW_AT_name("psI2CInst")
    2292                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("psI2CInst")
    2293                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2295                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2296                            .dwattr $C$DW$201, DW_AT_decl_line(0x32)
    2297                            .dwattr $C$DW$201, DW_AT_decl_column(0x14)
    2298                    
    2299                    $C$DW$202       .dwtag  DW_TAG_member
    2300                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2301                            .dwattr $C$DW$202, DW_AT_name("ui8Addr")
    2302                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("ui8Addr")
    2303                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2304                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2305                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2306                            .dwattr $C$DW$202, DW_AT_decl_line(0x37)
    2307                            .dwattr $C$DW$202, DW_AT_decl_column(0x0d)
    2308                    
    2309                    $C$DW$203       .dwtag  DW_TAG_member
    2310                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2311                            .dwattr $C$DW$203, DW_AT_name("ui8State")
    2312                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("ui8State")
    2313                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2314                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2315                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2316                            .dwattr $C$DW$203, DW_AT_decl_line(0x3c)
    2317                            .dwattr $C$DW$203, DW_AT_decl_column(0x0d)
    2318                    
    2319                    $C$DW$204       .dwtag  DW_TAG_member
    2320                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$40)
    2321                            .dwattr $C$DW$204, DW_AT_name("pui8Data")
    2322                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("pui8Data")
    2323                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2324                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2325                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2326                            .dwattr $C$DW$204, DW_AT_decl_line(0x41)
    2327                            .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    2328                    
    2329                    $C$DW$205       .dwtag  DW_TAG_member
    2330                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$28)
    2331                            .dwattr $C$DW$205, DW_AT_name("pfnCallback")
    2332                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("pfnCallback")
    2333                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2334                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2335                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   45

    2336                            .dwattr $C$DW$205, DW_AT_decl_line(0x47)
    2337                            .dwattr $C$DW$205, DW_AT_decl_column(0x16)
    2338                    
    2339                    $C$DW$206       .dwtag  DW_TAG_member
    2340                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$3)
    2341                            .dwattr $C$DW$206, DW_AT_name("pvCallbackData")
    2342                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pvCallbackData")
    2343                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2344                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2345                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2346                            .dwattr $C$DW$206, DW_AT_decl_line(0x4c)
    2347                            .dwattr $C$DW$206, DW_AT_decl_column(0x0b)
    2348                    
    2349                    $C$DW$207       .dwtag  DW_TAG_member
    2350                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$51)
    2351                            .dwattr $C$DW$207, DW_AT_name("uCommand")
    2352                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("uCommand")
    2353                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2354                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2355                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2356                            .dwattr $C$DW$207, DW_AT_decl_line(0x64)
    2357                            .dwattr $C$DW$207, DW_AT_decl_column(0x05)
    2358                    
    2359                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2360                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x2d)
    2361                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2362                            .dwendtag $C$DW$T$41
    2363                    
    2364                    $C$DW$T$42      .dwtag  DW_TAG_typedef
    2365                            .dwattr $C$DW$T$42, DW_AT_name("tAK8975")
    2366                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    2367                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    2368                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2369                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x66)
    2370                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    2371                    
    2372                    
    2373                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2374                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x6c)
    2375                    $C$DW$208       .dwtag  DW_TAG_member
    2376                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$34)
    2377                            .dwattr $C$DW$208, DW_AT_name("psI2CInst")
    2378                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("psI2CInst")
    2379                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2380                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2381                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2382                            .dwattr $C$DW$208, DW_AT_decl_line(0x33)
    2383                            .dwattr $C$DW$208, DW_AT_decl_column(0x14)
    2384                    
    2385                    $C$DW$209       .dwtag  DW_TAG_member
    2386                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$42)
    2387                            .dwattr $C$DW$209, DW_AT_name("sAK8975Inst")
    2388                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("sAK8975Inst")
    2389                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2390                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   46

    2391                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2392                            .dwattr $C$DW$209, DW_AT_decl_line(0x38)
    2393                            .dwattr $C$DW$209, DW_AT_decl_column(0x0d)
    2394                    
    2395                    $C$DW$210       .dwtag  DW_TAG_member
    2396                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2397                            .dwattr $C$DW$210, DW_AT_name("ui8Addr")
    2398                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("ui8Addr")
    2399                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2400                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2401                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2402                            .dwattr $C$DW$210, DW_AT_decl_line(0x3d)
    2403                            .dwattr $C$DW$210, DW_AT_decl_column(0x0d)
    2404                    
    2405                    $C$DW$211       .dwtag  DW_TAG_member
    2406                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2407                            .dwattr $C$DW$211, DW_AT_name("ui8State")
    2408                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("ui8State")
    2409                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x31]
    2410                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2411                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2412                            .dwattr $C$DW$211, DW_AT_decl_line(0x42)
    2413                            .dwattr $C$DW$211, DW_AT_decl_column(0x0d)
    2414                    
    2415                    $C$DW$212       .dwtag  DW_TAG_member
    2416                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2417                            .dwattr $C$DW$212, DW_AT_name("ui8AccelAfsSel")
    2418                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("ui8AccelAfsSel")
    2419                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    2420                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2421                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2422                            .dwattr $C$DW$212, DW_AT_decl_line(0x47)
    2423                            .dwattr $C$DW$212, DW_AT_decl_column(0x0d)
    2424                    
    2425                    $C$DW$213       .dwtag  DW_TAG_member
    2426                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    2427                            .dwattr $C$DW$213, DW_AT_name("ui8NewAccelAfsSel")
    2428                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("ui8NewAccelAfsSel")
    2429                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x33]
    2430                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2431                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2432                            .dwattr $C$DW$213, DW_AT_decl_line(0x4d)
    2433                            .dwattr $C$DW$213, DW_AT_decl_column(0x0d)
    2434                    
    2435                    $C$DW$214       .dwtag  DW_TAG_member
    2436                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2437                            .dwattr $C$DW$214, DW_AT_name("ui8GyroFsSel")
    2438                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("ui8GyroFsSel")
    2439                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2440                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2441                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2442                            .dwattr $C$DW$214, DW_AT_decl_line(0x52)
    2443                            .dwattr $C$DW$214, DW_AT_decl_column(0x0d)
    2444                    
    2445                    $C$DW$215       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   47

    2446                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2447                            .dwattr $C$DW$215, DW_AT_name("ui8NewGyroFsSel")
    2448                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("ui8NewGyroFsSel")
    2449                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
    2450                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2451                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2452                            .dwattr $C$DW$215, DW_AT_decl_line(0x58)
    2453                            .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    2454                    
    2455                    $C$DW$216       .dwtag  DW_TAG_member
    2456                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$43)
    2457                            .dwattr $C$DW$216, DW_AT_name("pui8Data")
    2458                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("pui8Data")
    2459                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    2460                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2461                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2462                            .dwattr $C$DW$216, DW_AT_decl_line(0x5d)
    2463                            .dwattr $C$DW$216, DW_AT_decl_column(0x0d)
    2464                    
    2465                    $C$DW$217       .dwtag  DW_TAG_member
    2466                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$28)
    2467                            .dwattr $C$DW$217, DW_AT_name("pfnCallback")
    2468                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("pfnCallback")
    2469                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    2470                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2471                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2472                            .dwattr $C$DW$217, DW_AT_decl_line(0x63)
    2473                            .dwattr $C$DW$217, DW_AT_decl_column(0x16)
    2474                    
    2475                    $C$DW$218       .dwtag  DW_TAG_member
    2476                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$3)
    2477                            .dwattr $C$DW$218, DW_AT_name("pvCallbackData")
    2478                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("pvCallbackData")
    2479                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    2480                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2481                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2482                            .dwattr $C$DW$218, DW_AT_decl_line(0x68)
    2483                            .dwattr $C$DW$218, DW_AT_decl_column(0x0b)
    2484                    
    2485                    $C$DW$219       .dwtag  DW_TAG_member
    2486                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$53)
    2487                            .dwattr $C$DW$219, DW_AT_name("uCommand")
    2488                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("uCommand")
    2489                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    2490                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2491                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2492                            .dwattr $C$DW$219, DW_AT_decl_line(0x80)
    2493                            .dwattr $C$DW$219, DW_AT_decl_column(0x05)
    2494                    
    2495                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2496                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x2e)
    2497                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    2498                            .dwendtag $C$DW$T$44
    2499                    
    2500                    $C$DW$T$93      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   48

    2501                            .dwattr $C$DW$T$93, DW_AT_name("tMPU9150")
    2502                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$44)
    2503                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    2504                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2505                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x82)
    2506                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x01)
    2507                    
    2508                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    2509                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$93)
    2510                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    2511                    
    2512                    
    2513                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    2514                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x18)
    2515                    $C$DW$220       .dwtag  DW_TAG_member
    2516                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$10)
    2517                            .dwattr $C$DW$220, DW_AT_name("fd")
    2518                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("fd")
    2519                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2520                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2521                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2522                            .dwattr $C$DW$220, DW_AT_decl_line(0x5c)
    2523                            .dwattr $C$DW$220, DW_AT_decl_column(0x0b)
    2524                    
    2525                    $C$DW$221       .dwtag  DW_TAG_member
    2526                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$45)
    2527                            .dwattr $C$DW$221, DW_AT_name("buf")
    2528                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("buf")
    2529                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2530                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2531                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2532                            .dwattr $C$DW$221, DW_AT_decl_line(0x5d)
    2533                            .dwattr $C$DW$221, DW_AT_decl_column(0x16)
    2534                    
    2535                    $C$DW$222       .dwtag  DW_TAG_member
    2536                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$45)
    2537                            .dwattr $C$DW$222, DW_AT_name("pos")
    2538                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("pos")
    2539                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2540                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2541                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2542                            .dwattr $C$DW$222, DW_AT_decl_line(0x5e)
    2543                            .dwattr $C$DW$222, DW_AT_decl_column(0x16)
    2544                    
    2545                    $C$DW$223       .dwtag  DW_TAG_member
    2546                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$45)
    2547                            .dwattr $C$DW$223, DW_AT_name("bufend")
    2548                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("bufend")
    2549                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2550                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2551                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2552                            .dwattr $C$DW$223, DW_AT_decl_line(0x5f)
    2553                            .dwattr $C$DW$223, DW_AT_decl_column(0x16)
    2554                    
    2555                    $C$DW$224       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   49

    2556                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$45)
    2557                            .dwattr $C$DW$224, DW_AT_name("buff_stop")
    2558                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("buff_stop")
    2559                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2560                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2561                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2562                            .dwattr $C$DW$224, DW_AT_decl_line(0x60)
    2563                            .dwattr $C$DW$224, DW_AT_decl_column(0x16)
    2564                    
    2565                    $C$DW$225       .dwtag  DW_TAG_member
    2566                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$11)
    2567                            .dwattr $C$DW$225, DW_AT_name("flags")
    2568                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("flags")
    2569                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2570                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2571                            .dwattr $C$DW$225, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2572                            .dwattr $C$DW$225, DW_AT_decl_line(0x61)
    2573                            .dwattr $C$DW$225, DW_AT_decl_column(0x16)
    2574                    
    2575                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2576                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x5b)
    2577                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    2578                            .dwendtag $C$DW$T$46
    2579                    
    2580                    $C$DW$T$95      .dwtag  DW_TAG_typedef
    2581                            .dwattr $C$DW$T$95, DW_AT_name("FILE")
    2582                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$46)
    2583                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    2584                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2585                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x62)
    2586                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    2587                    
    2588                    
    2589                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    2590                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x14)
    2591                    $C$DW$226       .dwtag  DW_TAG_member
    2592                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$34)
    2593                            .dwattr $C$DW$226, DW_AT_name("psI2CInst")
    2594                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("psI2CInst")
    2595                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2596                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2597                            .dwattr $C$DW$226, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2598                            .dwattr $C$DW$226, DW_AT_decl_line(0x14c)
    2599                            .dwattr $C$DW$226, DW_AT_decl_column(0x14)
    2600                    
    2601                    $C$DW$227       .dwtag  DW_TAG_member
    2602                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$23)
    2603                            .dwattr $C$DW$227, DW_AT_name("pui8Data")
    2604                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("pui8Data")
    2605                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2606                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2607                            .dwattr $C$DW$227, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2608                            .dwattr $C$DW$227, DW_AT_decl_line(0x151)
    2609                            .dwattr $C$DW$227, DW_AT_decl_column(0x0e)
    2610                    
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   50

    2611                    $C$DW$228       .dwtag  DW_TAG_member
    2612                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$22)
    2613                            .dwattr $C$DW$228, DW_AT_name("ui16Count")
    2614                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("ui16Count")
    2615                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2616                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2617                            .dwattr $C$DW$228, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2618                            .dwattr $C$DW$228, DW_AT_decl_line(0x156)
    2619                            .dwattr $C$DW$228, DW_AT_decl_column(0x0e)
    2620                    
    2621                    $C$DW$229       .dwtag  DW_TAG_member
    2622                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$28)
    2623                            .dwattr $C$DW$229, DW_AT_name("pfnCallback")
    2624                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("pfnCallback")
    2625                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2626                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2627                            .dwattr $C$DW$229, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2628                            .dwattr $C$DW$229, DW_AT_decl_line(0x15b)
    2629                            .dwattr $C$DW$229, DW_AT_decl_column(0x16)
    2630                    
    2631                    $C$DW$230       .dwtag  DW_TAG_member
    2632                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$3)
    2633                            .dwattr $C$DW$230, DW_AT_name("pvCallbackData")
    2634                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("pvCallbackData")
    2635                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2636                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2637                            .dwattr $C$DW$230, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2638                            .dwattr $C$DW$230, DW_AT_decl_line(0x160)
    2639                            .dwattr $C$DW$230, DW_AT_decl_column(0x0b)
    2640                    
    2641                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2642                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x147)
    2643                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x01)
    2644                            .dwendtag $C$DW$T$47
    2645                    
    2646                    $C$DW$T$96      .dwtag  DW_TAG_typedef
    2647                            .dwattr $C$DW$T$96, DW_AT_name("tI2CMRead16BE")
    2648                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$47)
    2649                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    2650                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2651                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x162)
    2652                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x01)
    2653                    
    2654                    
    2655                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    2656                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x14)
    2657                    $C$DW$231       .dwtag  DW_TAG_member
    2658                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$34)
    2659                            .dwattr $C$DW$231, DW_AT_name("psI2CInst")
    2660                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("psI2CInst")
    2661                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2662                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2663                            .dwattr $C$DW$231, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2664                            .dwattr $C$DW$231, DW_AT_decl_line(0x170)
    2665                            .dwattr $C$DW$231, DW_AT_decl_column(0x14)
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   51

    2666                    
    2667                    $C$DW$232       .dwtag  DW_TAG_member
    2668                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$37)
    2669                            .dwattr $C$DW$232, DW_AT_name("pui8Buffer")
    2670                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("pui8Buffer")
    2671                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2672                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2673                            .dwattr $C$DW$232, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2674                            .dwattr $C$DW$232, DW_AT_decl_line(0x175)
    2675                            .dwattr $C$DW$232, DW_AT_decl_column(0x0d)
    2676                    
    2677                    $C$DW$233       .dwtag  DW_TAG_member
    2678                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$22)
    2679                            .dwattr $C$DW$233, DW_AT_name("ui16Count")
    2680                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("ui16Count")
    2681                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2682                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2683                            .dwattr $C$DW$233, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2684                            .dwattr $C$DW$233, DW_AT_decl_line(0x17a)
    2685                            .dwattr $C$DW$233, DW_AT_decl_column(0x0e)
    2686                    
    2687                    $C$DW$234       .dwtag  DW_TAG_member
    2688                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$21)
    2689                            .dwattr $C$DW$234, DW_AT_name("pui8Data")
    2690                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("pui8Data")
    2691                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2692                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2693                            .dwattr $C$DW$234, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2694                            .dwattr $C$DW$234, DW_AT_decl_line(0x17f)
    2695                            .dwattr $C$DW$234, DW_AT_decl_column(0x14)
    2696                    
    2697                    $C$DW$235       .dwtag  DW_TAG_member
    2698                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$28)
    2699                            .dwattr $C$DW$235, DW_AT_name("pfnCallback")
    2700                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("pfnCallback")
    2701                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2702                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2703                            .dwattr $C$DW$235, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2704                            .dwattr $C$DW$235, DW_AT_decl_line(0x184)
    2705                            .dwattr $C$DW$235, DW_AT_decl_column(0x16)
    2706                    
    2707                    $C$DW$236       .dwtag  DW_TAG_member
    2708                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$3)
    2709                            .dwattr $C$DW$236, DW_AT_name("pvCallbackData")
    2710                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("pvCallbackData")
    2711                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2712                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    2713                            .dwattr $C$DW$236, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2714                            .dwattr $C$DW$236, DW_AT_decl_line(0x189)
    2715                            .dwattr $C$DW$236, DW_AT_decl_column(0x0b)
    2716                    
    2717                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2718                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x16b)
    2719                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    2720                            .dwendtag $C$DW$T$48
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   52

    2721                    
    2722                    $C$DW$T$97      .dwtag  DW_TAG_typedef
    2723                            .dwattr $C$DW$T$97, DW_AT_name("tI2CMWrite16BE")
    2724                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$48)
    2725                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    2726                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2727                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x18b)
    2728                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x01)
    2729                    
    2730                    
    2731                    $C$DW$T$51      .dwtag  DW_TAG_union_type
    2732                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x14)
    2733                    $C$DW$237       .dwtag  DW_TAG_member
    2734                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$37)
    2735                            .dwattr $C$DW$237, DW_AT_name("pui8Buffer")
    2736                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("pui8Buffer")
    2737                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2738                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2739                            .dwattr $C$DW$237, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2740                            .dwattr $C$DW$237, DW_AT_decl_line(0x58)
    2741                            .dwattr $C$DW$237, DW_AT_decl_column(0x11)
    2742                    
    2743                    $C$DW$238       .dwtag  DW_TAG_member
    2744                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$49)
    2745                            .dwattr $C$DW$238, DW_AT_name("sWriteState")
    2746                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("sWriteState")
    2747                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2748                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2749                            .dwattr $C$DW$238, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2750                            .dwattr $C$DW$238, DW_AT_decl_line(0x5d)
    2751                            .dwattr $C$DW$238, DW_AT_decl_column(0x15)
    2752                    
    2753                    $C$DW$239       .dwtag  DW_TAG_member
    2754                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$50)
    2755                            .dwattr $C$DW$239, DW_AT_name("sReadModifyWriteState")
    2756                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2757                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2758                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2759                            .dwattr $C$DW$239, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2760                            .dwattr $C$DW$239, DW_AT_decl_line(0x62)
    2761                            .dwattr $C$DW$239, DW_AT_decl_column(0x1f)
    2762                    
    2763                            .dwattr $C$DW$T$51, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/ak8975.h")
    2764                            .dwattr $C$DW$T$51, DW_AT_decl_line(0x54)
    2765                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x05)
    2766                            .dwendtag $C$DW$T$51
    2767                    
    2768                    
    2769                    $C$DW$T$53      .dwtag  DW_TAG_union_type
    2770                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x14)
    2771                    $C$DW$240       .dwtag  DW_TAG_member
    2772                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$52)
    2773                            .dwattr $C$DW$240, DW_AT_name("pui8Buffer")
    2774                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("pui8Buffer")
    2775                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   53

    2776                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2777                            .dwattr $C$DW$240, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2778                            .dwattr $C$DW$240, DW_AT_decl_line(0x74)
    2779                            .dwattr $C$DW$240, DW_AT_decl_column(0x11)
    2780                    
    2781                    $C$DW$241       .dwtag  DW_TAG_member
    2782                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$49)
    2783                            .dwattr $C$DW$241, DW_AT_name("sWriteState")
    2784                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("sWriteState")
    2785                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2786                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2787                            .dwattr $C$DW$241, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2788                            .dwattr $C$DW$241, DW_AT_decl_line(0x79)
    2789                            .dwattr $C$DW$241, DW_AT_decl_column(0x15)
    2790                    
    2791                    $C$DW$242       .dwtag  DW_TAG_member
    2792                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$50)
    2793                            .dwattr $C$DW$242, DW_AT_name("sReadModifyWriteState")
    2794                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("sReadModifyWriteState")
    2795                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2796                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2797                            .dwattr $C$DW$242, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2798                            .dwattr $C$DW$242, DW_AT_decl_line(0x7e)
    2799                            .dwattr $C$DW$242, DW_AT_decl_column(0x1f)
    2800                    
    2801                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/mpu9150.h")
    2802                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x70)
    2803                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x05)
    2804                            .dwendtag $C$DW$T$53
    2805                    
    2806                    
    2807                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    2808                            .dwattr $C$DW$T$55, DW_AT_name("HeapRegion")
    2809                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x08)
    2810                    $C$DW$243       .dwtag  DW_TAG_member
    2811                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$23)
    2812                            .dwattr $C$DW$243, DW_AT_name("pucStartAddress")
    2813                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("pucStartAddress")
    2814                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2815                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2816                            .dwattr $C$DW$243, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2817                            .dwattr $C$DW$243, DW_AT_decl_line(0x96)
    2818                            .dwattr $C$DW$243, DW_AT_decl_column(0x0b)
    2819                    
    2820                    $C$DW$244       .dwtag  DW_TAG_member
    2821                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$54)
    2822                            .dwattr $C$DW$244, DW_AT_name("xSizeInBytes")
    2823                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("xSizeInBytes")
    2824                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2825                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2826                            .dwattr $C$DW$244, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2827                            .dwattr $C$DW$244, DW_AT_decl_line(0x97)
    2828                            .dwattr $C$DW$244, DW_AT_decl_column(0x09)
    2829                    
    2830                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   54

    2831                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x94)
    2832                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    2833                            .dwendtag $C$DW$T$55
    2834                    
    2835                    $C$DW$T$98      .dwtag  DW_TAG_typedef
    2836                            .dwattr $C$DW$T$98, DW_AT_name("HeapRegion_t")
    2837                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$55)
    2838                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    2839                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2840                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x98)
    2841                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    2842                    
    2843                    
    2844                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    2845                            .dwattr $C$DW$T$56, DW_AT_name("ReportData_Item")
    2846                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x18)
    2847                    $C$DW$245       .dwtag  DW_TAG_member
    2848                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$24)
    2849                            .dwattr $C$DW$245, DW_AT_name("TimeStamp")
    2850                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("TimeStamp")
    2851                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2852                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2853                            .dwattr $C$DW$245, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2854                            .dwattr $C$DW$245, DW_AT_decl_line(0x20)
    2855                            .dwattr $C$DW$245, DW_AT_decl_column(0x2b)
    2856                    
    2857                    $C$DW$246       .dwtag  DW_TAG_member
    2858                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$24)
    2859                            .dwattr $C$DW$246, DW_AT_name("ReportName")
    2860                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("ReportName")
    2861                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2862                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2863                            .dwattr $C$DW$246, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2864                            .dwattr $C$DW$246, DW_AT_decl_line(0x21)
    2865                            .dwattr $C$DW$246, DW_AT_decl_column(0x13)
    2866                    
    2867                    $C$DW$247       .dwtag  DW_TAG_member
    2868                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$24)
    2869                            .dwattr $C$DW$247, DW_AT_name("ReportValue_0")
    2870                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("ReportValue_0")
    2871                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2872                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2873                            .dwattr $C$DW$247, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2874                            .dwattr $C$DW$247, DW_AT_decl_line(0x22)
    2875                            .dwattr $C$DW$247, DW_AT_decl_column(0x13)
    2876                    
    2877                    $C$DW$248       .dwtag  DW_TAG_member
    2878                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$24)
    2879                            .dwattr $C$DW$248, DW_AT_name("ReportValue_1")
    2880                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("ReportValue_1")
    2881                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2882                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2883                            .dwattr $C$DW$248, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2884                            .dwattr $C$DW$248, DW_AT_decl_line(0x23)
    2885                            .dwattr $C$DW$248, DW_AT_decl_column(0x13)
TI ARM Assembler PC v15.12.1 Thu Dec 01 13:25:52 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Magnetometer.asm                                                     PAGE   55

    2886                    
    2887                    $C$DW$249       .dwtag  DW_TAG_member
    2888                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$24)
    2889                            .dwattr $C$DW$249, DW_AT_name("ReportValue_2")
    2890                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("ReportValue_2")
    2891                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2892                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2893                            .dwattr $C$DW$249, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Proj2_Magnetometer/Tasks/Task_Repo
    2894                            .dwattr $C$DW$249, DW_AT_decl_line(0x24)
    2895                            .dwattr $C$DW$249, DW_AT_decl_column(0x13)
    2896                    
