TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                       PC v15.12.1.LTS *
       3                    ;* Date/Time created: Tue Oct 18 10:42:46 2016                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --diag_wrap=off --disab
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("../Tasks/Task_I2C7_Handler.c")
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen PC v15.12.1.LTS Copyright (c) 1996-2
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("C:\TI_ARM_Tiva_Projects\Proj2_Magnetometer\Debug")
      13                    
      14                    $C$DW$1 .dwtag  DW_TAG_subprogram

    1825                            .dwattr $C$DW$162, DW_AT_name("eIncrement")
    1826                            .dwattr $C$DW$162, DW_AT_const_value(0x02)
    1827                            .dwattr $C$DW$162, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1828                            .dwattr $C$DW$162, DW_AT_decl_line(0x7e)
    1829                            .dwattr $C$DW$162, DW_AT_decl_column(0x02)
    1830                    
    1831                    $C$DW$163       .dwtag  DW_TAG_enumerator
    1832                            .dwattr $C$DW$163, DW_AT_name("eSetValueWithOverwrite")
    1833                            .dwattr $C$DW$163, DW_AT_const_value(0x03)
    1834                            .dwattr $C$DW$163, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1835                            .dwattr $C$DW$163, DW_AT_decl_line(0x7f)
    1836                            .dwattr $C$DW$163, DW_AT_decl_column(0x02)
    1837                    
    1838                    $C$DW$164       .dwtag  DW_TAG_enumerator
    1839                            .dwattr $C$DW$164, DW_AT_name("eSetValueWithoutOverwrite")
    1840                            .dwattr $C$DW$164, DW_AT_const_value(0x04)
    1841                            .dwattr $C$DW$164, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1842                            .dwattr $C$DW$164, DW_AT_decl_line(0x80)
    1843                            .dwattr $C$DW$164, DW_AT_decl_column(0x02)
    1844                    
    1845                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1846                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x7b)
    1847                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x01)
    1848                            .dwendtag $C$DW$T$76
    1849                    
    1850                    $C$DW$T$77      .dwtag  DW_TAG_typedef
    1851                            .dwattr $C$DW$T$77, DW_AT_name("eNotifyAction")
    1852                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$76)
    1853                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1854                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1855                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x81)
    1856                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    1857                    
    1858                    
    1859                    $C$DW$T$78      .dwtag  DW_TAG_enumeration_type
    1860                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x01)
    1861                    $C$DW$165       .dwtag  DW_TAG_enumerator
    1862                            .dwattr $C$DW$165, DW_AT_name("eAbortSleep")
    1863                            .dwattr $C$DW$165, DW_AT_const_value(0x00)
    1864                            .dwattr $C$DW$165, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1865                            .dwattr $C$DW$165, DW_AT_decl_line(0xb5)
    1866                            .dwattr $C$DW$165, DW_AT_decl_column(0x02)
    1867                    
    1868                    $C$DW$166       .dwtag  DW_TAG_enumerator
    1869                            .dwattr $C$DW$166, DW_AT_name("eStandardSleep")
    1870                            .dwattr $C$DW$166, DW_AT_const_value(0x01)
    1871                            .dwattr $C$DW$166, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1872                            .dwattr $C$DW$166, DW_AT_decl_line(0xb6)
    1873                            .dwattr $C$DW$166, DW_AT_decl_column(0x02)
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   36

    1874                    
    1875                    $C$DW$167       .dwtag  DW_TAG_enumerator
    1876                            .dwattr $C$DW$167, DW_AT_name("eNoTasksWaitingTimeout")
    1877                            .dwattr $C$DW$167, DW_AT_const_value(0x02)
    1878                            .dwattr $C$DW$167, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1879                            .dwattr $C$DW$167, DW_AT_decl_line(0xb7)
    1880                            .dwattr $C$DW$167, DW_AT_decl_column(0x02)
    1881                    
    1882                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1883                            .dwattr $C$DW$T$78, DW_AT_decl_line(0xb4)
    1884                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x01)
    1885                            .dwendtag $C$DW$T$78
    1886                    
    1887                    $C$DW$T$79      .dwtag  DW_TAG_typedef
    1888                            .dwattr $C$DW$T$79, DW_AT_name("eSleepModeStatus")
    1889                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$78)
    1890                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1891                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    1892                            .dwattr $C$DW$T$79, DW_AT_decl_line(0xb8)
    1893                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    1894                    
    1895                    
    1896                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1897                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x1c)
    1898                    $C$DW$168       .dwtag  DW_TAG_member
    1899                            .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1900                            .dwattr $C$DW$168, DW_AT_name("ui8Addr")
    1901                            .dwattr $C$DW$168, DW_AT_TI_symbol_name("ui8Addr")
    1902                            .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1903                            .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1904                            .dwattr $C$DW$168, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1905                            .dwattr $C$DW$168, DW_AT_decl_line(0x4c)
    1906                            .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    1907                    
    1908                    $C$DW$169       .dwtag  DW_TAG_member
    1909                            .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    1910                            .dwattr $C$DW$169, DW_AT_name("pui8WriteData")
    1911                            .dwattr $C$DW$169, DW_AT_TI_symbol_name("pui8WriteData")
    1912                            .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1913                            .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1914                            .dwattr $C$DW$169, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1915                            .dwattr $C$DW$169, DW_AT_decl_line(0x51)
    1916                            .dwattr $C$DW$169, DW_AT_decl_column(0x14)
    1917                    
    1918                    $C$DW$170       .dwtag  DW_TAG_member
    1919                            .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$22)
    1920                            .dwattr $C$DW$170, DW_AT_name("ui16WriteCount")
    1921                            .dwattr $C$DW$170, DW_AT_TI_symbol_name("ui16WriteCount")
    1922                            .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1923                            .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1924                            .dwattr $C$DW$170, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1925                            .dwattr $C$DW$170, DW_AT_decl_line(0x56)
    1926                            .dwattr $C$DW$170, DW_AT_decl_column(0x0e)
    1927                    
    1928                    $C$DW$171       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   37

    1929                            .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$22)
    1930                            .dwattr $C$DW$171, DW_AT_name("ui16WriteBatchSize")
    1931                            .dwattr $C$DW$171, DW_AT_TI_symbol_name("ui16WriteBatchSize")
    1932                            .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1933                            .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1934                            .dwattr $C$DW$171, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1935                            .dwattr $C$DW$171, DW_AT_decl_line(0x5b)
    1936                            .dwattr $C$DW$171, DW_AT_decl_column(0x0e)
    1937                    
    1938                    $C$DW$172       .dwtag  DW_TAG_member
    1939                            .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$23)
    1940                            .dwattr $C$DW$172, DW_AT_name("pui8ReadData")
    1941                            .dwattr $C$DW$172, DW_AT_TI_symbol_name("pui8ReadData")
    1942                            .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1943                            .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1944                            .dwattr $C$DW$172, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1945                            .dwattr $C$DW$172, DW_AT_decl_line(0x60)
    1946                            .dwattr $C$DW$172, DW_AT_decl_column(0x0e)
    1947                    
    1948                    $C$DW$173       .dwtag  DW_TAG_member
    1949                            .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$22)
    1950                            .dwattr $C$DW$173, DW_AT_name("ui16ReadCount")
    1951                            .dwattr $C$DW$173, DW_AT_TI_symbol_name("ui16ReadCount")
    1952                            .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1953                            .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1954                            .dwattr $C$DW$173, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1955                            .dwattr $C$DW$173, DW_AT_decl_line(0x65)
    1956                            .dwattr $C$DW$173, DW_AT_decl_column(0x0e)
    1957                    
    1958                    $C$DW$174       .dwtag  DW_TAG_member
    1959                            .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$22)
    1960                            .dwattr $C$DW$174, DW_AT_name("ui16ReadBatchSize")
    1961                            .dwattr $C$DW$174, DW_AT_TI_symbol_name("ui16ReadBatchSize")
    1962                            .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1963                            .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1964                            .dwattr $C$DW$174, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1965                            .dwattr $C$DW$174, DW_AT_decl_line(0x6a)
    1966                            .dwattr $C$DW$174, DW_AT_decl_column(0x0e)
    1967                    
    1968                    $C$DW$175       .dwtag  DW_TAG_member
    1969                            .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$28)
    1970                            .dwattr $C$DW$175, DW_AT_name("pfnCallback")
    1971                            .dwattr $C$DW$175, DW_AT_TI_symbol_name("pfnCallback")
    1972                            .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1973                            .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1974                            .dwattr $C$DW$175, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1975                            .dwattr $C$DW$175, DW_AT_decl_line(0x6f)
    1976                            .dwattr $C$DW$175, DW_AT_decl_column(0x16)
    1977                    
    1978                    $C$DW$176       .dwtag  DW_TAG_member
    1979                            .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$3)
    1980                            .dwattr $C$DW$176, DW_AT_name("pvCallbackData")
    1981                            .dwattr $C$DW$176, DW_AT_TI_symbol_name("pvCallbackData")
    1982                            .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1983                            .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   38

    1984                            .dwattr $C$DW$176, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1985                            .dwattr $C$DW$176, DW_AT_decl_line(0x74)
    1986                            .dwattr $C$DW$176, DW_AT_decl_column(0x0b)
    1987                    
    1988                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1989                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    1990                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    1991                            .dwendtag $C$DW$T$29
    1992                    
    1993                    $C$DW$T$30      .dwtag  DW_TAG_typedef
    1994                            .dwattr $C$DW$T$30, DW_AT_name("tI2CMCommand")
    1995                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    1996                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1997                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    1998                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x76)
    1999                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x01)
    2000                    
    2001                    
    2002                    $C$DW$T$31      .dwtag  DW_TAG_array_type
    2003                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$30)
    2004                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2005                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x118)
    2006                    $C$DW$177       .dwtag  DW_TAG_subrange_type
    2007                            .dwattr $C$DW$177, DW_AT_upper_bound(0x09)
    2008                    
    2009                            .dwendtag $C$DW$T$31
    2010                    
    2011                    
    2012                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    2013                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x124)
    2014                    $C$DW$178       .dwtag  DW_TAG_member
    2015                            .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$24)
    2016                            .dwattr $C$DW$178, DW_AT_name("ui32Base")
    2017                            .dwattr $C$DW$178, DW_AT_TI_symbol_name("ui32Base")
    2018                            .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2019                            .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2020                            .dwattr $C$DW$178, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2021                            .dwattr $C$DW$178, DW_AT_decl_line(0x82)
    2022                            .dwattr $C$DW$178, DW_AT_decl_column(0x0e)
    2023                    
    2024                    $C$DW$179       .dwtag  DW_TAG_member
    2025                            .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2026                            .dwattr $C$DW$179, DW_AT_name("ui8Int")
    2027                            .dwattr $C$DW$179, DW_AT_TI_symbol_name("ui8Int")
    2028                            .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2029                            .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2030                            .dwattr $C$DW$179, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2031                            .dwattr $C$DW$179, DW_AT_decl_line(0x87)
    2032                            .dwattr $C$DW$179, DW_AT_decl_column(0x0d)
    2033                    
    2034                    $C$DW$180       .dwtag  DW_TAG_member
    2035                            .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2036                            .dwattr $C$DW$180, DW_AT_name("ui8TxDMA")
    2037                            .dwattr $C$DW$180, DW_AT_TI_symbol_name("ui8TxDMA")
    2038                            .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   39

    2039                            .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2040                            .dwattr $C$DW$180, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2041                            .dwattr $C$DW$180, DW_AT_decl_line(0x8c)
    2042                            .dwattr $C$DW$180, DW_AT_decl_column(0x0d)
    2043                    
    2044                    $C$DW$181       .dwtag  DW_TAG_member
    2045                            .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2046                            .dwattr $C$DW$181, DW_AT_name("ui8RxDMA")
    2047                            .dwattr $C$DW$181, DW_AT_TI_symbol_name("ui8RxDMA")
    2048                            .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2049                            .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2050                            .dwattr $C$DW$181, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2051                            .dwattr $C$DW$181, DW_AT_decl_line(0x91)
    2052                            .dwattr $C$DW$181, DW_AT_decl_column(0x0d)
    2053                    
    2054                    $C$DW$182       .dwtag  DW_TAG_member
    2055                            .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2056                            .dwattr $C$DW$182, DW_AT_name("ui8State")
    2057                            .dwattr $C$DW$182, DW_AT_TI_symbol_name("ui8State")
    2058                            .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2059                            .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2060                            .dwattr $C$DW$182, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2061                            .dwattr $C$DW$182, DW_AT_decl_line(0x96)
    2062                            .dwattr $C$DW$182, DW_AT_decl_column(0x0d)
    2063                    
    2064                    $C$DW$183       .dwtag  DW_TAG_member
    2065                            .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2066                            .dwattr $C$DW$183, DW_AT_name("ui8ReadPtr")
    2067                            .dwattr $C$DW$183, DW_AT_TI_symbol_name("ui8ReadPtr")
    2068                            .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2069                            .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2070                            .dwattr $C$DW$183, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2071                            .dwattr $C$DW$183, DW_AT_decl_line(0x9c)
    2072                            .dwattr $C$DW$183, DW_AT_decl_column(0x0d)
    2073                    
    2074                    $C$DW$184       .dwtag  DW_TAG_member
    2075                            .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2076                            .dwattr $C$DW$184, DW_AT_name("ui8WritePtr")
    2077                            .dwattr $C$DW$184, DW_AT_TI_symbol_name("ui8WritePtr")
    2078                            .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2079                            .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2080                            .dwattr $C$DW$184, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2081                            .dwattr $C$DW$184, DW_AT_decl_line(0xa2)
    2082                            .dwattr $C$DW$184, DW_AT_decl_column(0x0d)
    2083                    
    2084                    $C$DW$185       .dwtag  DW_TAG_member
    2085                            .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    2086                            .dwattr $C$DW$185, DW_AT_name("ui16Index")
    2087                            .dwattr $C$DW$185, DW_AT_TI_symbol_name("ui16Index")
    2088                            .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2089                            .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2090                            .dwattr $C$DW$185, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2091                            .dwattr $C$DW$185, DW_AT_decl_line(0xa7)
    2092                            .dwattr $C$DW$185, DW_AT_decl_column(0x0e)
    2093                    
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   40

    2094                    $C$DW$186       .dwtag  DW_TAG_member
    2095                            .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$31)
    2096                            .dwattr $C$DW$186, DW_AT_name("pCommands")
    2097                            .dwattr $C$DW$186, DW_AT_TI_symbol_name("pCommands")
    2098                            .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2099                            .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2100                            .dwattr $C$DW$186, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2101                            .dwattr $C$DW$186, DW_AT_decl_line(0xac)
    2102                            .dwattr $C$DW$186, DW_AT_decl_column(0x12)
    2103                    
    2104                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2105                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x7e)
    2106                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x01)
    2107                            .dwendtag $C$DW$T$32
    2108                    
    2109                    $C$DW$T$33      .dwtag  DW_TAG_typedef
    2110                            .dwattr $C$DW$T$33, DW_AT_name("tI2CMInstance")
    2111                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2112                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2113                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2114                            .dwattr $C$DW$T$33, DW_AT_decl_line(0xae)
    2115                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    2116                    
    2117                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2118                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2119                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2120                    
    2121                    
    2122                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2123                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x18)
    2124                    $C$DW$187       .dwtag  DW_TAG_member
    2125                            .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$34)
    2126                            .dwattr $C$DW$187, DW_AT_name("psI2CInst")
    2127                            .dwattr $C$DW$187, DW_AT_TI_symbol_name("psI2CInst")
    2128                            .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2129                            .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2130                            .dwattr $C$DW$187, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2131                            .dwattr $C$DW$187, DW_AT_decl_line(0xf0)
    2132                            .dwattr $C$DW$187, DW_AT_decl_column(0x14)
    2133                    
    2134                    $C$DW$188       .dwtag  DW_TAG_member
    2135                            .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$35)
    2136                            .dwattr $C$DW$188, DW_AT_name("pui8Buffer")
    2137                            .dwattr $C$DW$188, DW_AT_TI_symbol_name("pui8Buffer")
    2138                            .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2139                            .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2140                            .dwattr $C$DW$188, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2141                            .dwattr $C$DW$188, DW_AT_decl_line(0xf5)
    2142                            .dwattr $C$DW$188, DW_AT_decl_column(0x0d)
    2143                    
    2144                    $C$DW$189       .dwtag  DW_TAG_member
    2145                            .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2146                            .dwattr $C$DW$189, DW_AT_name("ui8State")
    2147                            .dwattr $C$DW$189, DW_AT_TI_symbol_name("ui8State")
    2148                            .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   41

    2149                            .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2150                            .dwattr $C$DW$189, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2151                            .dwattr $C$DW$189, DW_AT_decl_line(0xfa)
    2152                            .dwattr $C$DW$189, DW_AT_decl_column(0x0d)
    2153                    
    2154                    $C$DW$190       .dwtag  DW_TAG_member
    2155                            .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2156                            .dwattr $C$DW$190, DW_AT_name("ui8Addr")
    2157                            .dwattr $C$DW$190, DW_AT_TI_symbol_name("ui8Addr")
    2158                            .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2159                            .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2160                            .dwattr $C$DW$190, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2161                            .dwattr $C$DW$190, DW_AT_decl_line(0xff)
    2162                            .dwattr $C$DW$190, DW_AT_decl_column(0x0d)
    2163                    
    2164                    $C$DW$191       .dwtag  DW_TAG_member
    2165                            .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$22)
    2166                            .dwattr $C$DW$191, DW_AT_name("ui16Mask")
    2167                            .dwattr $C$DW$191, DW_AT_TI_symbol_name("ui16Mask")
    2168                            .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2169                            .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2170                            .dwattr $C$DW$191, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2171                            .dwattr $C$DW$191, DW_AT_decl_line(0x104)
    2172                            .dwattr $C$DW$191, DW_AT_decl_column(0x0e)
    2173                    
    2174                    $C$DW$192       .dwtag  DW_TAG_member
    2175                            .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$22)
    2176                            .dwattr $C$DW$192, DW_AT_name("ui16Value")
    2177                            .dwattr $C$DW$192, DW_AT_TI_symbol_name("ui16Value")
    2178                            .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2179                            .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2180                            .dwattr $C$DW$192, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2181                            .dwattr $C$DW$192, DW_AT_decl_line(0x109)
    2182                            .dwattr $C$DW$192, DW_AT_decl_column(0x0e)
    2183                    
    2184                    $C$DW$193       .dwtag  DW_TAG_member
    2185                            .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$28)
    2186                            .dwattr $C$DW$193, DW_AT_name("pfnCallback")
    2187                            .dwattr $C$DW$193, DW_AT_TI_symbol_name("pfnCallback")
    2188                            .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2189                            .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2190                            .dwattr $C$DW$193, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2191                            .dwattr $C$DW$193, DW_AT_decl_line(0x10f)
    2192                            .dwattr $C$DW$193, DW_AT_decl_column(0x16)
    2193                    
    2194                    $C$DW$194       .dwtag  DW_TAG_member
    2195                            .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$3)
    2196                            .dwattr $C$DW$194, DW_AT_name("pvCallbackData")
    2197                            .dwattr $C$DW$194, DW_AT_TI_symbol_name("pvCallbackData")
    2198                            .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2199                            .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2200                            .dwattr $C$DW$194, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2201                            .dwattr $C$DW$194, DW_AT_decl_line(0x114)
    2202                            .dwattr $C$DW$194, DW_AT_decl_column(0x0b)
    2203                    
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   42

    2204                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2205                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xeb)
    2206                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x01)
    2207                            .dwendtag $C$DW$T$36
    2208                    
    2209                    $C$DW$T$80      .dwtag  DW_TAG_typedef
    2210                            .dwattr $C$DW$T$80, DW_AT_name("tI2CMReadModifyWrite16")
    2211                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$36)
    2212                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2213                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2214                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x116)
    2215                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x01)
    2216                    
    2217                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    2218                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    2219                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    2220                    
    2221                    
    2222                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2223                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x14)
    2224                    $C$DW$195       .dwtag  DW_TAG_member
    2225                            .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$34)
    2226                            .dwattr $C$DW$195, DW_AT_name("psI2CInst")
    2227                            .dwattr $C$DW$195, DW_AT_TI_symbol_name("psI2CInst")
    2228                            .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2229                            .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2230                            .dwattr $C$DW$195, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2231                            .dwattr $C$DW$195, DW_AT_decl_line(0xbc)
    2232                            .dwattr $C$DW$195, DW_AT_decl_column(0x14)
    2233                    
    2234                    $C$DW$196       .dwtag  DW_TAG_member
    2235                            .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$35)
    2236                            .dwattr $C$DW$196, DW_AT_name("pui8Buffer")
    2237                            .dwattr $C$DW$196, DW_AT_TI_symbol_name("pui8Buffer")
    2238                            .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2239                            .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2240                            .dwattr $C$DW$196, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2241                            .dwattr $C$DW$196, DW_AT_decl_line(0xc1)
    2242                            .dwattr $C$DW$196, DW_AT_decl_column(0x0d)
    2243                    
    2244                    $C$DW$197       .dwtag  DW_TAG_member
    2245                            .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2246                            .dwattr $C$DW$197, DW_AT_name("ui8State")
    2247                            .dwattr $C$DW$197, DW_AT_TI_symbol_name("ui8State")
    2248                            .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2249                            .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2250                            .dwattr $C$DW$197, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2251                            .dwattr $C$DW$197, DW_AT_decl_line(0xc6)
    2252                            .dwattr $C$DW$197, DW_AT_decl_column(0x0d)
    2253                    
    2254                    $C$DW$198       .dwtag  DW_TAG_member
    2255                            .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2256                            .dwattr $C$DW$198, DW_AT_name("ui8Addr")
    2257                            .dwattr $C$DW$198, DW_AT_TI_symbol_name("ui8Addr")
    2258                            .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   43

    2259                            .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2260                            .dwattr $C$DW$198, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2261                            .dwattr $C$DW$198, DW_AT_decl_line(0xcb)
    2262                            .dwattr $C$DW$198, DW_AT_decl_column(0x0d)
    2263                    
    2264                    $C$DW$199       .dwtag  DW_TAG_member
    2265                            .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2266                            .dwattr $C$DW$199, DW_AT_name("ui8Mask")
    2267                            .dwattr $C$DW$199, DW_AT_TI_symbol_name("ui8Mask")
    2268                            .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2269                            .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2270                            .dwattr $C$DW$199, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2271                            .dwattr $C$DW$199, DW_AT_decl_line(0xd0)
    2272                            .dwattr $C$DW$199, DW_AT_decl_column(0x0d)
    2273                    
    2274                    $C$DW$200       .dwtag  DW_TAG_member
    2275                            .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2276                            .dwattr $C$DW$200, DW_AT_name("ui8Value")
    2277                            .dwattr $C$DW$200, DW_AT_TI_symbol_name("ui8Value")
    2278                            .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2279                            .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2280                            .dwattr $C$DW$200, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2281                            .dwattr $C$DW$200, DW_AT_decl_line(0xd5)
    2282                            .dwattr $C$DW$200, DW_AT_decl_column(0x0d)
    2283                    
    2284                    $C$DW$201       .dwtag  DW_TAG_member
    2285                            .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$28)
    2286                            .dwattr $C$DW$201, DW_AT_name("pfnCallback")
    2287                            .dwattr $C$DW$201, DW_AT_TI_symbol_name("pfnCallback")
    2288                            .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2289                            .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2290                            .dwattr $C$DW$201, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2291                            .dwattr $C$DW$201, DW_AT_decl_line(0xdb)
    2292                            .dwattr $C$DW$201, DW_AT_decl_column(0x16)
    2293                    
    2294                    $C$DW$202       .dwtag  DW_TAG_member
    2295                            .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$3)
    2296                            .dwattr $C$DW$202, DW_AT_name("pvCallbackData")
    2297                            .dwattr $C$DW$202, DW_AT_TI_symbol_name("pvCallbackData")
    2298                            .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2299                            .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2300                            .dwattr $C$DW$202, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2301                            .dwattr $C$DW$202, DW_AT_decl_line(0xe0)
    2302                            .dwattr $C$DW$202, DW_AT_decl_column(0x0b)
    2303                    
    2304                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2305                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xb7)
    2306                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    2307                            .dwendtag $C$DW$T$37
    2308                    
    2309                    $C$DW$T$82      .dwtag  DW_TAG_typedef
    2310                            .dwattr $C$DW$T$82, DW_AT_name("tI2CMReadModifyWrite8")
    2311                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$37)
    2312                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    2313                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   44

    2314                            .dwattr $C$DW$T$82, DW_AT_decl_line(0xe2)
    2315                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x01)
    2316                    
    2317                    
    2318                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2319                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x14)
    2320                    $C$DW$203       .dwtag  DW_TAG_member
    2321                            .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$34)
    2322                            .dwattr $C$DW$203, DW_AT_name("psI2CInst")
    2323                            .dwattr $C$DW$203, DW_AT_TI_symbol_name("psI2CInst")
    2324                            .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2325                            .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2326                            .dwattr $C$DW$203, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2327                            .dwattr $C$DW$203, DW_AT_decl_line(0x123)
    2328                            .dwattr $C$DW$203, DW_AT_decl_column(0x14)
    2329                    
    2330                    $C$DW$204       .dwtag  DW_TAG_member
    2331                            .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$38)
    2332                            .dwattr $C$DW$204, DW_AT_name("pui8Buffer")
    2333                            .dwattr $C$DW$204, DW_AT_TI_symbol_name("pui8Buffer")
    2334                            .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2335                            .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2336                            .dwattr $C$DW$204, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2337                            .dwattr $C$DW$204, DW_AT_decl_line(0x128)
    2338                            .dwattr $C$DW$204, DW_AT_decl_column(0x0d)
    2339                    
    2340                    $C$DW$205       .dwtag  DW_TAG_member
    2341                            .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$22)
    2342                            .dwattr $C$DW$205, DW_AT_name("ui16Count")
    2343                            .dwattr $C$DW$205, DW_AT_TI_symbol_name("ui16Count")
    2344                            .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2345                            .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2346                            .dwattr $C$DW$205, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2347                            .dwattr $C$DW$205, DW_AT_decl_line(0x12d)
    2348                            .dwattr $C$DW$205, DW_AT_decl_column(0x0e)
    2349                    
    2350                    $C$DW$206       .dwtag  DW_TAG_member
    2351                            .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$21)
    2352                            .dwattr $C$DW$206, DW_AT_name("pui8Data")
    2353                            .dwattr $C$DW$206, DW_AT_TI_symbol_name("pui8Data")
    2354                            .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2355                            .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2356                            .dwattr $C$DW$206, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2357                            .dwattr $C$DW$206, DW_AT_decl_line(0x132)
    2358                            .dwattr $C$DW$206, DW_AT_decl_column(0x14)
    2359                    
    2360                    $C$DW$207       .dwtag  DW_TAG_member
    2361                            .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$28)
    2362                            .dwattr $C$DW$207, DW_AT_name("pfnCallback")
    2363                            .dwattr $C$DW$207, DW_AT_TI_symbol_name("pfnCallback")
    2364                            .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2365                            .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2366                            .dwattr $C$DW$207, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2367                            .dwattr $C$DW$207, DW_AT_decl_line(0x137)
    2368                            .dwattr $C$DW$207, DW_AT_decl_column(0x16)
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   45

    2369                    
    2370                    $C$DW$208       .dwtag  DW_TAG_member
    2371                            .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$3)
    2372                            .dwattr $C$DW$208, DW_AT_name("pvCallbackData")
    2373                            .dwattr $C$DW$208, DW_AT_TI_symbol_name("pvCallbackData")
    2374                            .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2375                            .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2376                            .dwattr $C$DW$208, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2377                            .dwattr $C$DW$208, DW_AT_decl_line(0x13c)
    2378                            .dwattr $C$DW$208, DW_AT_decl_column(0x0b)
    2379                    
    2380                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2381                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x11e)
    2382                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x01)
    2383                            .dwendtag $C$DW$T$39
    2384                    
    2385                    $C$DW$T$83      .dwtag  DW_TAG_typedef
    2386                            .dwattr $C$DW$T$83, DW_AT_name("tI2CMWrite8")
    2387                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$39)
    2388                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2389                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2390                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x13e)
    2391                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x01)
    2392                    
    2393                    
    2394                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2395                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x14)
    2396                    $C$DW$209       .dwtag  DW_TAG_member
    2397                            .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$34)
    2398                            .dwattr $C$DW$209, DW_AT_name("psI2CInst")
    2399                            .dwattr $C$DW$209, DW_AT_TI_symbol_name("psI2CInst")
    2400                            .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2401                            .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2402                            .dwattr $C$DW$209, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2403                            .dwattr $C$DW$209, DW_AT_decl_line(0x14c)
    2404                            .dwattr $C$DW$209, DW_AT_decl_column(0x14)
    2405                    
    2406                    $C$DW$210       .dwtag  DW_TAG_member
    2407                            .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$23)
    2408                            .dwattr $C$DW$210, DW_AT_name("pui8Data")
    2409                            .dwattr $C$DW$210, DW_AT_TI_symbol_name("pui8Data")
    2410                            .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2411                            .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2412                            .dwattr $C$DW$210, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2413                            .dwattr $C$DW$210, DW_AT_decl_line(0x151)
    2414                            .dwattr $C$DW$210, DW_AT_decl_column(0x0e)
    2415                    
    2416                    $C$DW$211       .dwtag  DW_TAG_member
    2417                            .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$22)
    2418                            .dwattr $C$DW$211, DW_AT_name("ui16Count")
    2419                            .dwattr $C$DW$211, DW_AT_TI_symbol_name("ui16Count")
    2420                            .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2421                            .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2422                            .dwattr $C$DW$211, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2423                            .dwattr $C$DW$211, DW_AT_decl_line(0x156)
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   46

    2424                            .dwattr $C$DW$211, DW_AT_decl_column(0x0e)
    2425                    
    2426                    $C$DW$212       .dwtag  DW_TAG_member
    2427                            .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$28)
    2428                            .dwattr $C$DW$212, DW_AT_name("pfnCallback")
    2429                            .dwattr $C$DW$212, DW_AT_TI_symbol_name("pfnCallback")
    2430                            .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2431                            .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2432                            .dwattr $C$DW$212, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2433                            .dwattr $C$DW$212, DW_AT_decl_line(0x15b)
    2434                            .dwattr $C$DW$212, DW_AT_decl_column(0x16)
    2435                    
    2436                    $C$DW$213       .dwtag  DW_TAG_member
    2437                            .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$3)
    2438                            .dwattr $C$DW$213, DW_AT_name("pvCallbackData")
    2439                            .dwattr $C$DW$213, DW_AT_TI_symbol_name("pvCallbackData")
    2440                            .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2441                            .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2442                            .dwattr $C$DW$213, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2443                            .dwattr $C$DW$213, DW_AT_decl_line(0x160)
    2444                            .dwattr $C$DW$213, DW_AT_decl_column(0x0b)
    2445                    
    2446                            .dwattr $C$DW$T$40, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2447                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x147)
    2448                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x01)
    2449                            .dwendtag $C$DW$T$40
    2450                    
    2451                    $C$DW$T$84      .dwtag  DW_TAG_typedef
    2452                            .dwattr $C$DW$T$84, DW_AT_name("tI2CMRead16BE")
    2453                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$40)
    2454                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    2455                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2456                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x162)
    2457                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x01)
    2458                    
    2459                    
    2460                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    2461                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x14)
    2462                    $C$DW$214       .dwtag  DW_TAG_member
    2463                            .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$34)
    2464                            .dwattr $C$DW$214, DW_AT_name("psI2CInst")
    2465                            .dwattr $C$DW$214, DW_AT_TI_symbol_name("psI2CInst")
    2466                            .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2467                            .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2468                            .dwattr $C$DW$214, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2469                            .dwattr $C$DW$214, DW_AT_decl_line(0x170)
    2470                            .dwattr $C$DW$214, DW_AT_decl_column(0x14)
    2471                    
    2472                    $C$DW$215       .dwtag  DW_TAG_member
    2473                            .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$38)
    2474                            .dwattr $C$DW$215, DW_AT_name("pui8Buffer")
    2475                            .dwattr $C$DW$215, DW_AT_TI_symbol_name("pui8Buffer")
    2476                            .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2477                            .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2478                            .dwattr $C$DW$215, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   47

    2479                            .dwattr $C$DW$215, DW_AT_decl_line(0x175)
    2480                            .dwattr $C$DW$215, DW_AT_decl_column(0x0d)
    2481                    
    2482                    $C$DW$216       .dwtag  DW_TAG_member
    2483                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$22)
    2484                            .dwattr $C$DW$216, DW_AT_name("ui16Count")
    2485                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("ui16Count")
    2486                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2487                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2488                            .dwattr $C$DW$216, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2489                            .dwattr $C$DW$216, DW_AT_decl_line(0x17a)
    2490                            .dwattr $C$DW$216, DW_AT_decl_column(0x0e)
    2491                    
    2492                    $C$DW$217       .dwtag  DW_TAG_member
    2493                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$21)
    2494                            .dwattr $C$DW$217, DW_AT_name("pui8Data")
    2495                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("pui8Data")
    2496                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2497                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2498                            .dwattr $C$DW$217, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2499                            .dwattr $C$DW$217, DW_AT_decl_line(0x17f)
    2500                            .dwattr $C$DW$217, DW_AT_decl_column(0x14)
    2501                    
    2502                    $C$DW$218       .dwtag  DW_TAG_member
    2503                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$28)
    2504                            .dwattr $C$DW$218, DW_AT_name("pfnCallback")
    2505                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("pfnCallback")
    2506                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2507                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2508                            .dwattr $C$DW$218, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2509                            .dwattr $C$DW$218, DW_AT_decl_line(0x184)
    2510                            .dwattr $C$DW$218, DW_AT_decl_column(0x16)
    2511                    
    2512                    $C$DW$219       .dwtag  DW_TAG_member
    2513                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$3)
    2514                            .dwattr $C$DW$219, DW_AT_name("pvCallbackData")
    2515                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("pvCallbackData")
    2516                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2517                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2518                            .dwattr $C$DW$219, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2519                            .dwattr $C$DW$219, DW_AT_decl_line(0x189)
    2520                            .dwattr $C$DW$219, DW_AT_decl_column(0x0b)
    2521                    
    2522                            .dwattr $C$DW$T$41, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2523                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x16b)
    2524                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x01)
    2525                            .dwendtag $C$DW$T$41
    2526                    
    2527                    $C$DW$T$85      .dwtag  DW_TAG_typedef
    2528                            .dwattr $C$DW$T$85, DW_AT_name("tI2CMWrite16BE")
    2529                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$41)
    2530                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    2531                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2532                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x18b)
    2533                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x01)
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   48

    2534                    
    2535                    
    2536                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    2537                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x18)
    2538                    $C$DW$220       .dwtag  DW_TAG_member
    2539                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$10)
    2540                            .dwattr $C$DW$220, DW_AT_name("fd")
    2541                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("fd")
    2542                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2543                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2544                            .dwattr $C$DW$220, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2545                            .dwattr $C$DW$220, DW_AT_decl_line(0x5c)
    2546                            .dwattr $C$DW$220, DW_AT_decl_column(0x0b)
    2547                    
    2548                    $C$DW$221       .dwtag  DW_TAG_member
    2549                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$42)
    2550                            .dwattr $C$DW$221, DW_AT_name("buf")
    2551                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("buf")
    2552                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2553                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2554                            .dwattr $C$DW$221, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2555                            .dwattr $C$DW$221, DW_AT_decl_line(0x5d)
    2556                            .dwattr $C$DW$221, DW_AT_decl_column(0x16)
    2557                    
    2558                    $C$DW$222       .dwtag  DW_TAG_member
    2559                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$42)
    2560                            .dwattr $C$DW$222, DW_AT_name("pos")
    2561                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("pos")
    2562                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2563                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2564                            .dwattr $C$DW$222, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2565                            .dwattr $C$DW$222, DW_AT_decl_line(0x5e)
    2566                            .dwattr $C$DW$222, DW_AT_decl_column(0x16)
    2567                    
    2568                    $C$DW$223       .dwtag  DW_TAG_member
    2569                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$42)
    2570                            .dwattr $C$DW$223, DW_AT_name("bufend")
    2571                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("bufend")
    2572                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2573                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2574                            .dwattr $C$DW$223, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2575                            .dwattr $C$DW$223, DW_AT_decl_line(0x5f)
    2576                            .dwattr $C$DW$223, DW_AT_decl_column(0x16)
    2577                    
    2578                    $C$DW$224       .dwtag  DW_TAG_member
    2579                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$42)
    2580                            .dwattr $C$DW$224, DW_AT_name("buff_stop")
    2581                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("buff_stop")
    2582                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2583                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2584                            .dwattr $C$DW$224, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2585                            .dwattr $C$DW$224, DW_AT_decl_line(0x60)
    2586                            .dwattr $C$DW$224, DW_AT_decl_column(0x16)
    2587                    
    2588                    $C$DW$225       .dwtag  DW_TAG_member
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   49

    2589                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$11)
    2590                            .dwattr $C$DW$225, DW_AT_name("flags")
    2591                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("flags")
    2592                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2593                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2594                            .dwattr $C$DW$225, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.1
    2595                            .dwattr $C$DW$225, DW_AT_decl_line(0x61)
    2596                            .dwattr $C$DW$225, DW_AT_decl_column(0x16)
    2597                    
    2598                            .dwattr $C$DW$T$43, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2599                            .dwattr $C$DW$T$43, DW_AT_decl_line(0x5b)
    2600                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    2601                            .dwendtag $C$DW$T$43
    2602                    
    2603                    $C$DW$T$86      .dwtag  DW_TAG_typedef
    2604                            .dwattr $C$DW$T$86, DW_AT_name("FILE")
    2605                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$43)
    2606                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    2607                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2608                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x62)
    2609                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    2610                    
    2611                    
    2612                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    2613                            .dwattr $C$DW$T$45, DW_AT_name("HeapRegion")
    2614                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x08)
    2615                    $C$DW$226       .dwtag  DW_TAG_member
    2616                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$23)
    2617                            .dwattr $C$DW$226, DW_AT_name("pucStartAddress")
    2618                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("pucStartAddress")
    2619                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2620                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2621                            .dwattr $C$DW$226, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2622                            .dwattr $C$DW$226, DW_AT_decl_line(0x96)
    2623                            .dwattr $C$DW$226, DW_AT_decl_column(0x0b)
    2624                    
    2625                    $C$DW$227       .dwtag  DW_TAG_member
    2626                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$44)
    2627                            .dwattr $C$DW$227, DW_AT_name("xSizeInBytes")
    2628                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("xSizeInBytes")
    2629                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2630                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2631                            .dwattr $C$DW$227, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2632                            .dwattr $C$DW$227, DW_AT_decl_line(0x97)
    2633                            .dwattr $C$DW$227, DW_AT_decl_column(0x09)
    2634                    
    2635                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2636                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x94)
    2637                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
    2638                            .dwendtag $C$DW$T$45
    2639                    
    2640                    $C$DW$T$87      .dwtag  DW_TAG_typedef
    2641                            .dwattr $C$DW$T$87, DW_AT_name("HeapRegion_t")
    2642                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$45)
    2643                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   50

    2644                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\portable.h")
    2645                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x98)
    2646                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    2647                    
    2648                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    2649                            .dwattr $C$DW$T$2, DW_AT_name("void")
    2650                    
    2651                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    2652                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    2653                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    2654                    
    2655                    $C$DW$T$88      .dwtag  DW_TAG_typedef
    2656                            .dwattr $C$DW$T$88, DW_AT_name("QueueHandle_t")
    2657                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$3)
    2658                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2659                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\queue.h")
    2660                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x58)
    2661                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x10)
    2662                    
    2663                    $C$DW$T$89      .dwtag  DW_TAG_typedef
    2664                            .dwattr $C$DW$T$89, DW_AT_name("SemaphoreHandle_t")
    2665                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    2666                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    2667                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/semphr.h")
    2668                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x4f)
    2669                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x17)
    2670                    
    2671                    $C$DW$T$90      .dwtag  DW_TAG_typedef
    2672                            .dwattr $C$DW$T$90, DW_AT_name("QueueSetHandle_t")
    2673                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$3)
    2674                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    2675                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\queue.h")
    2676                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x5f)
    2677                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x10)
    2678                    
    2679                    $C$DW$T$91      .dwtag  DW_TAG_typedef
    2680                            .dwattr $C$DW$T$91, DW_AT_name("QueueSetMemberHandle_t")
    2681                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$3)
    2682                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    2683                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\queue.h")
    2684                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x66)
    2685                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x10)
    2686                    
    2687                    $C$DW$T$69      .dwtag  DW_TAG_typedef
    2688                            .dwattr $C$DW$T$69, DW_AT_name("TaskHandle_t")
    2689                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$3)
    2690                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2691                            .dwattr $C$DW$T$69, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    2692                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x67)
    2693                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
    2694                    
    2695                    
    2696                    $C$DW$T$26      .dwtag  DW_TAG_subroutine_type
    2697                            .dwattr $C$DW$T$26, DW_AT_language(DW_LANG_C)
    2698                    $C$DW$228       .dwtag  DW_TAG_formal_parameter
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   51

    2699                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$3)
    2700                    
    2701                    $C$DW$229       .dwtag  DW_TAG_formal_parameter
    2702                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$25)
    2703                    
    2704                            .dwendtag $C$DW$T$26
    2705                    
    2706                    $C$DW$T$27      .dwtag  DW_TAG_typedef
    2707                            .dwattr $C$DW$T$27, DW_AT_name("tSensorCallback")
    2708                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$26)
    2709                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    2710                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/TI_CodeComposer/TivaWare/sensorlib/i2cm_drv.h")
    2711                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2c)
    2712                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x0f)
    2713                    
    2714                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    2715                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    2716                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    2717                    
    2718                    
    2719                    $C$DW$T$57      .dwtag  DW_TAG_subroutine_type
    2720                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    2721                    $C$DW$230       .dwtag  DW_TAG_formal_parameter
    2722                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$3)
    2723                    
    2724                            .dwendtag $C$DW$T$57
    2725                    
    2726                    $C$DW$T$58      .dwtag  DW_TAG_pointer_type
    2727                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$57)
    2728                            .dwattr $C$DW$T$58, DW_AT_address_class(0x20)
    2729                    
    2730                    $C$DW$T$59      .dwtag  DW_TAG_typedef
    2731                            .dwattr $C$DW$T$59, DW_AT_name("TaskFunction_t")
    2732                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2733                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2734                            .dwattr $C$DW$T$59, DW_AT_decl_file("C:\TI_ARM_Tiva_Projects\Source\include\projdefs.h")
    2735                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x4d)
    2736                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x10)
    2737                    
    2738                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    2739                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    2740                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    2741                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    2742                    
    2743                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    2744                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    2745                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    2746                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    2747                    
    2748                    $C$DW$T$108     .dwtag  DW_TAG_typedef
    2749                            .dwattr $C$DW$T$108, DW_AT_name("int8_t")
    2750                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$5)
    2751                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    2752                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2753                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x2a)
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   52

    2754                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x1d)
    2755                    
    2756                    $C$DW$T$109     .dwtag  DW_TAG_typedef
    2757                            .dwattr $C$DW$T$109, DW_AT_name("int_least8_t")
    2758                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    2759                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    2760                            .dwattr $C$DW$T$109, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2761                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x37)
    2762                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x17)
    2763                    
    2764                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    2765                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2766                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    2767                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    2768                    
    2769                    $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    2770                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$6)
    2771                            .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    2772                    
    2773                    $C$DW$T$19      .dwtag  DW_TAG_typedef
    2774                            .dwattr $C$DW$T$19, DW_AT_name("uint8_t")
    2775                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    2776                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    2777                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2778                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    2779                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    2780                    
    2781                    $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    2782                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$19)
    2783                            .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
    2784                    
    2785                    
    2786                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    2787                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    2788                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2789                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x04)
    2790                    $C$DW$231       .dwtag  DW_TAG_subrange_type
    2791                            .dwattr $C$DW$231, DW_AT_upper_bound(0x03)
    2792                    
    2793                            .dwendtag $C$DW$T$35
    2794                    
    2795                    
    2796                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    2797                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$19)
    2798                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2799                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2800                    $C$DW$232       .dwtag  DW_TAG_subrange_type
    2801                            .dwattr $C$DW$232, DW_AT_upper_bound(0x01)
    2802                    
    2803                            .dwendtag $C$DW$T$38
    2804                    
    2805                    
    2806                    $C$DW$T$110     .dwtag  DW_TAG_array_type
    2807                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$19)
    2808                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   53

    2809                            .dwattr $C$DW$T$110, DW_AT_byte_size(0x08)
    2810                    $C$DW$233       .dwtag  DW_TAG_subrange_type
    2811                            .dwattr $C$DW$233, DW_AT_upper_bound(0x07)
    2812                    
    2813                            .dwendtag $C$DW$T$110
    2814                    
    2815                    $C$DW$T$111     .dwtag  DW_TAG_typedef
    2816                            .dwattr $C$DW$T$111, DW_AT_name("portCHAR")
    2817                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$19)
    2818                            .dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
    2819                            .dwattr $C$DW$T$111, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/portable/CCS/ARM_CM4F/por
    2820                            .dwattr $C$DW$T$111, DW_AT_decl_line(0x60)
    2821                            .dwattr $C$DW$T$111, DW_AT_decl_column(0x12)
    2822                    
    2823                    $C$DW$T$20      .dwtag  DW_TAG_const_type
    2824                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    2825                    
    2826                    $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    2827                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    2828                            .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    2829                    
    2830                    $C$DW$T$112     .dwtag  DW_TAG_typedef
    2831                            .dwattr $C$DW$T$112, DW_AT_name("uint_least8_t")
    2832                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$19)
    2833                            .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    2834                            .dwattr $C$DW$T$112, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2835                            .dwattr $C$DW$T$112, DW_AT_decl_line(0x38)
    2836                            .dwattr $C$DW$T$112, DW_AT_decl_column(0x16)
    2837                    
    2838                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    2839                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    2840                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    2841                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    2842                    
    2843                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    2844                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2845                            .dwattr $C$DW$T$8, DW_AT_name("short")
    2846                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    2847                    
    2848                    $C$DW$T$113     .dwtag  DW_TAG_typedef
    2849                            .dwattr $C$DW$T$113, DW_AT_name("int16_t")
    2850                            .dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$8)
    2851                            .dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
    2852                            .dwattr $C$DW$T$113, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2853                            .dwattr $C$DW$T$113, DW_AT_decl_line(0x2c)
    2854                            .dwattr $C$DW$T$113, DW_AT_decl_column(0x1d)
    2855                    
    2856                    $C$DW$T$114     .dwtag  DW_TAG_typedef
    2857                            .dwattr $C$DW$T$114, DW_AT_name("int_least16_t")
    2858                            .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$113)
    2859                            .dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
    2860                            .dwattr $C$DW$T$114, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2861                            .dwattr $C$DW$T$114, DW_AT_decl_line(0x3a)
    2862                            .dwattr $C$DW$T$114, DW_AT_decl_column(0x17)
    2863                    
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   54

    2864                    $C$DW$T$115     .dwtag  DW_TAG_typedef
    2865                            .dwattr $C$DW$T$115, DW_AT_name("portSHORT")
    2866                            .dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$113)
    2867                            .dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
    2868                            .dwattr $C$DW$T$115, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/portable/CCS/ARM_CM4F/por
    2869                            .dwattr $C$DW$T$115, DW_AT_decl_line(0x64)
    2870                            .dwattr $C$DW$T$115, DW_AT_decl_column(0x12)
    2871                    
    2872                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    2873                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2874                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2875                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    2876                    
    2877                    $C$DW$T$22      .dwtag  DW_TAG_typedef
    2878                            .dwattr $C$DW$T$22, DW_AT_name("uint16_t")
    2879                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$9)
    2880                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    2881                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2882                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2d)
    2883                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x1c)
    2884                    
    2885                    $C$DW$T$116     .dwtag  DW_TAG_typedef
    2886                            .dwattr $C$DW$T$116, DW_AT_name("uint_least16_t")
    2887                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$22)
    2888                            .dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
    2889                            .dwattr $C$DW$T$116, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2890                            .dwattr $C$DW$T$116, DW_AT_decl_line(0x3b)
    2891                            .dwattr $C$DW$T$116, DW_AT_decl_column(0x16)
    2892                    
    2893                    $C$DW$T$117     .dwtag  DW_TAG_typedef
    2894                            .dwattr $C$DW$T$117, DW_AT_name("wchar_t")
    2895                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$9)
    2896                            .dwattr $C$DW$T$117, DW_AT_language(DW_LANG_C)
    2897                            .dwattr $C$DW$T$117, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2898                            .dwattr $C$DW$T$117, DW_AT_decl_line(0x41)
    2899                            .dwattr $C$DW$T$117, DW_AT_decl_column(0x1a)
    2900                    
    2901                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    2902                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2903                            .dwattr $C$DW$T$10, DW_AT_name("int")
    2904                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    2905                    
    2906                    $C$DW$T$73      .dwtag  DW_TAG_typedef
    2907                            .dwattr $C$DW$T$73, DW_AT_name("int32_t")
    2908                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$10)
    2909                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2910                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    2911                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x2e)
    2912                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x1d)
    2913                    
    2914                    $C$DW$T$74      .dwtag  DW_TAG_typedef
    2915                            .dwattr $C$DW$T$74, DW_AT_name("BaseType_t")
    2916                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2917                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    2918                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/portable/CCS/ARM_CM4F/port
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   55

    2919                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x69)
    2920                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x12)
    2921                    
    2922                    
    2923                    $C$DW$T$118     .dwtag  DW_TAG_subroutine_type
    2924                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$74)
    2925                            .dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
    2926                    $C$DW$234       .dwtag  DW_TAG_formal_parameter
    2927                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$3)
    2928                    
    2929                            .dwendtag $C$DW$T$118
    2930                    
    2931                    $C$DW$T$119     .dwtag  DW_TAG_pointer_type
    2932                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$118)
    2933                            .dwattr $C$DW$T$119, DW_AT_address_class(0x20)
    2934                    
    2935                    $C$DW$T$120     .dwtag  DW_TAG_typedef
    2936                            .dwattr $C$DW$T$120, DW_AT_name("TaskHookFunction_t")
    2937                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    2938                            .dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
    2939                            .dwattr $C$DW$T$120, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/include/task.h")
    2940                            .dwattr $C$DW$T$120, DW_AT_decl_line(0x6d)
    2941                            .dwattr $C$DW$T$120, DW_AT_decl_column(0x16)
    2942                    
    2943                    $C$DW$T$121     .dwtag  DW_TAG_typedef
    2944                            .dwattr $C$DW$T$121, DW_AT_name("int_fast16_t")
    2945                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$73)
    2946                            .dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
    2947                            .dwattr $C$DW$T$121, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2948                            .dwattr $C$DW$T$121, DW_AT_decl_line(0x47)
    2949                            .dwattr $C$DW$T$121, DW_AT_decl_column(0x17)
    2950                    
    2951                    $C$DW$T$122     .dwtag  DW_TAG_typedef
    2952                            .dwattr $C$DW$T$122, DW_AT_name("int_fast32_t")
    2953                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$73)
    2954                            .dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
    2955                            .dwattr $C$DW$T$122, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2956                            .dwattr $C$DW$T$122, DW_AT_decl_line(0x4a)
    2957                            .dwattr $C$DW$T$122, DW_AT_decl_column(0x17)
    2958                    
    2959                    $C$DW$T$123     .dwtag  DW_TAG_typedef
    2960                            .dwattr $C$DW$T$123, DW_AT_name("int_fast8_t")
    2961                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$73)
    2962                            .dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
    2963                            .dwattr $C$DW$T$123, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2964                            .dwattr $C$DW$T$123, DW_AT_decl_line(0x45)
    2965                            .dwattr $C$DW$T$123, DW_AT_decl_column(0x17)
    2966                    
    2967                    $C$DW$T$124     .dwtag  DW_TAG_typedef
    2968                            .dwattr $C$DW$T$124, DW_AT_name("int_least32_t")
    2969                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$73)
    2970                            .dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
    2971                            .dwattr $C$DW$T$124, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2972                            .dwattr $C$DW$T$124, DW_AT_decl_line(0x3c)
    2973                            .dwattr $C$DW$T$124, DW_AT_decl_column(0x17)
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   56

    2974                    
    2975                    $C$DW$T$125     .dwtag  DW_TAG_typedef
    2976                            .dwattr $C$DW$T$125, DW_AT_name("portBASE_TYPE")
    2977                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$73)
    2978                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    2979                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/portable/CCS/ARM_CM4F/por
    2980                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x66)
    2981                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x12)
    2982                    
    2983                    $C$DW$T$126     .dwtag  DW_TAG_typedef
    2984                            .dwattr $C$DW$T$126, DW_AT_name("portLONG")
    2985                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$73)
    2986                            .dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
    2987                            .dwattr $C$DW$T$126, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/portable/CCS/ARM_CM4F/por
    2988                            .dwattr $C$DW$T$126, DW_AT_decl_line(0x63)
    2989                            .dwattr $C$DW$T$126, DW_AT_decl_column(0x12)
    2990                    
    2991                    $C$DW$T$127     .dwtag  DW_TAG_typedef
    2992                            .dwattr $C$DW$T$127, DW_AT_name("intptr_t")
    2993                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$10)
    2994                            .dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
    2995                            .dwattr $C$DW$T$127, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    2996                            .dwattr $C$DW$T$127, DW_AT_decl_line(0x52)
    2997                            .dwattr $C$DW$T$127, DW_AT_decl_column(0x1a)
    2998                    
    2999                    $C$DW$T$128     .dwtag  DW_TAG_typedef
    3000                            .dwattr $C$DW$T$128, DW_AT_name("ptrdiff_t")
    3001                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$10)
    3002                            .dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
    3003                            .dwattr $C$DW$T$128, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12
    3004                            .dwattr $C$DW$T$128, DW_AT_decl_line(0x36)
    3005                            .dwattr $C$DW$T$128, DW_AT_decl_column(0x1c)
    3006                    
    3007                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3008                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3009                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3010                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3011                    
    3012                    $C$DW$T$44      .dwtag  DW_TAG_typedef
    3013                            .dwattr $C$DW$T$44, DW_AT_name("size_t")
    3014                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$11)
    3015                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3016                            .dwattr $C$DW$T$44, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    3017                            .dwattr $C$DW$T$44, DW_AT_decl_line(0x3a)
    3018                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x19)
    3019                    
    3020                    $C$DW$T$24      .dwtag  DW_TAG_typedef
    3021                            .dwattr $C$DW$T$24, DW_AT_name("uint32_t")
    3022                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$11)
    3023                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3024                            .dwattr $C$DW$T$24, DW_AT_decl_file("C:/TI_CodeComposer/ccsv6/tools/compiler/ti-cgt-arm_15.12.
    3025                            .dwattr $C$DW$T$24, DW_AT_decl_line(0x2f)
    3026                            .dwattr $C$DW$T$24, DW_AT_decl_column(0x1c)
    3027                    
    3028                    $C$DW$T$64      .dwtag  DW_TAG_typedef
TI ARM Assembler PC v15.12.1 Tue Oct 18 10:42:46 2016

Tools Copyright (c) 1996-2015 Texas Instruments Incorporated
Task_I2C7_Handler.asm                                                PAGE   57

    3029                            .dwattr $C$DW$T$64, DW_AT_name("StackType_t")
    3030                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$24)
    3031                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    3032                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/TI_ARM_Tiva_Projects/Source/portable/CCS/ARM_CM4F/port
    3033                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x68)
    3034                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x12)
    3035                    
    3036                    $C$DW$T$65      .dwtag  DW_TAG_pointer_type
